doc/org/artificial-intelligence-a-modern-approach.org
*** Thinking humanly: The cognitive modeling approach ... 3 
*** Thinking rationally: The ``laws of thought'' approach ... 4 
*** Acting rationally: The rational agent approach ... 4 
** The Foundations of Artificial Intelligence ... 5 
*** Philosophy ... 5 
*** Mathematics ... 7 
*** Economics ... 9 
*** Neuroscience ... 10 
*** Psychology ... 12 
*** Computer engineering ... 13 
*** Control theory and cybernetics ... 15 
*** Linguistics ... 15 
** The History of Artificial Intelligence ... 16 
*** The gestation of artificial intelligence (1943--1955) ... 16 
*** The birth of artificial intelligence (1956) ... 17 
*** Early enthusiasm, great expectations (1952--1969) ... 18 
*** A dose of reality (1966--1973) ... 20 
*** Knowledge-based systems: The key to power? (1969--1979) ... 22 
*** AI becomes an industry (1980--present) ... 24 
*** The return of neural networks (1986--present) ... 24 
*** AI adopts the scientific method (1987--present) ... 25 
*** The emergence of intelligent agents (1995--present) ... 26 
      1.3.10. The availability of very large data sets (2001--present) ... 27 
** The State of the Art ... 28 
** Summary ... 29 
** Bibliographical and Historical Notes ... 30 
** Exercises ... 31
* Intelligent Agents ... 34


** Agents and Environments ... 34 
** Good Behavior: The Concept of Rationality ... 36 
*** Rationality ... 37 
*** Omniscience, learning, and autonomy ... 38 
** The Nature of Environments ... 40 
*** Specifying the task environment ... 40 
*** Properties of task environments ... 41 
** The Structure of Agents ... 46 
*** Agent programs ... 46 
*** Simple reflex agents ... 48 
*** Model-based reflex agents ... 50 
*** Goal-based agents ... 52 
*** Utility-based agents ... 53 
*** Learning agents ... 54 
*** How the components of agent programs work ... 57 
** Summary ... 59 
** Bibliographical and Historical Notes ... 59 
** Exercises ... 61

* Solving Problems by Searching ... 64


** Problem-Solving Agents ... 64 
*** Well-defined problems and solutions ... 66 
*** Formulating problems ... 68 
** Example Problems ... 69 
*** Toy problems ... 70 
*** Real-world problems ... 73 
** Searching for Solutions ... 75 
*** Infrastructure for search algorithms ... 78 
*** Measuring problem-solving performance ... 80 
** Uninformed Search Strategies ... 81 
*** Breadth-first search ... 81 
*** Uniform-cost search ... 83 
*** Depth-first search ... 85 
*** Depth-limited search ... 87 
*** Iterative deepening depth-first search ... 88 
*** Bidirectional search ... 90 
*** Comparing uninformed search strategies ... 91 
** Informed (Heuristic) Search Strategies ... 92 
*** Greedy best-first search ... 92 
*** A* search: Minimizing the total estimated solution cost ... 93 
             Conditions for optimality: Admissibility and consistency ... 94 
             Optimality of A* ... 95 
*** Memory-bounded heuristic search ... 99 
*** Learning to search better ... 102 
** Heuristic Functions ... 102 
*** The effect of heuristic accuracy on performance ... 103 
