doc/org/artificial-intelligence-a-modern-approach.org
*** Generating admissible heuristics from relaxed problems ... 104 
*** Generating admissible heuristics from subproblems: Pattern databases ... 106 
*** Learning heuristics from experience ... 107 
** Summary ... 108 
** Bibliographical and Historical Notes ... 109 
** Exercises ... 112
* Beyond Classical Search ... 120


** Local Search Algorithms and Optimization Problems ... 120 
*** Hill-climbing search ... 122 
*** Simulated annealing ... 125 
*** Local beam search ... 125 
*** Genetic algorithms ... 126 
** Local Search in Continuous Spaces ... 129 
** Searching with Nondeterministic Actions ... 133 
*** The erratic vacuum world ... 133 
      4.3.2 AND-OR search trees ... 135 
*** Try, try again ... 137 
** Searching with Partial Observations ... 138 
*** Searching with no observation ... 138 
*** Searching with observations ... 142 
*** Solving partially observable problems ... 143 
*** An agent for partially observable environments ... 144 
** Online Search Agents and Unknown Environments ... 147 
*** Online search problems ... 147 
*** Online search agents ... 149 
*** Online local search ... 150 
*** Learning in online search ... 153 
** Summary ... 153 
** Bibliographical and Historical Notes ... 154 
** Exercises ... 157
* Adversarial Search ... 161


** Games ... 161 
** Optimal Decisions in Games ... 163 
*** The minimax algorithm ... 165 
*** Optimal decisions in multiplayer games ... 165 
** Alpha--Beta Pruning ... 167 
*** Move ordering ... 169 
** Imperfect Real-Time Decisions ... 171 
*** Evaluation functions ... 171 
*** Cutting off search ... 173 
*** Forward pruning ... 174 
*** Search versus lookup ... 176 
** Stochastic Games ... 177 
*** Evaluation functions for games of chance ... 178 
** Partially Observable Games ... 180 
*** Kriegspiel: Partially observable chess ... 180 
*** Card games ... 183 
** State-of-the-Art Game Programs ... 185 
** Alternative Approaches ... 187 
** Summary ... 189 
** Bibliographical and Historical Notes ... 190 
** Exercises ... 195
* Constraint Satisfaction Problems ... 202


** Defining Constraint Satisfaction Problems ... 202 
*** Example problem: Map coloring ... 203 
*** Example problem: Job-shop scheduling ... 204 
*** Variations on the CSP formalism ... 205 
** Constraint Propagation: Inference in CSPs ... 208 
*** Node consistency ... 208 
*** Arc consistency ... 208 
*** Path consistency ... 210 
*** K-consistency. ... 211 
*** Global constraints ... 211 
*** Sudoku example ... 212 
** Backtracking Search for CSPs ... 214 
*** Variable and value ordering ... 216 
*** Interleaving search and inference ... 217 
*** Intelligent backtracking: Looking backward ... 218 
** Local Search for CSPs ... 220 
** The Structure of Problems ... 222 
** Summary ... 227 
** Bibliographical and Historical Notes ... 227 
** Exercises ... 230

* Logical Agents ... 234


