doc/org/artificial-intelligence-a-modern-approach.org
** Knowledge-Based Agents ... 235 
** The Wumpus World ... 236 
** Logic ... 240 
** Propositional Logic: A Very Simple Logic ... 243 
*** Syntax ... 244 
*** Semantics ... 245 
*** A simple knowledge base ... 246 
*** A simple inference procedure ... 247 
** Propositional Theorem Proving ... 249 
*** Inference and proofs ... 250 
*** Proof by resolution ... 252 
             Conjunctive normal form ... 253 
             A resolution algorithm ... 254 
             Completeness of resolution ... 255 
*** Horn clauses and definite clauses ... 256 
*** Forward and backward chaining ... 257 
** Effective Propositional Model Checking ... 259 
*** A complete backtracking algorithm ... 260 
*** Local search algorithms ... 262 
*** The landscape of random SAT problems ... 263 
** Agents Based on Propositional Logic ... 265 
*** The current state of the world ... 265 
*** A hybrid agent ... 268 
*** Logical state estimation ... 269 
*** Making plans by propositional inference ... 271 
** Summary ... 274 
** Bibliographical and Historical Notes ... 275 
** Exercises ... 279
* First-Order Logic ... 285


** Representation Revisited ... 285 
*** The language of thought ... 286 
*** Combining the best of formal and natural languages ... 288 
** Syntax and Semantics of First-Order Logic ... 290 
*** Models for first-order logic ... 290 
*** Symbols and interpretations ... 292 
*** Terms ... 294 
*** Atomic sentences ... 294 
*** Complex sentences ... 295 
*** Quantifiers ... 295 
             Universal quantification (∀) ... 295 
             Existential quantification (∃) ... 297 
             Nested quantifiers ... 297 
             Connections between ∀ and ∃ ... 298 
*** Equality ... 299 
*** An alternative semantics? ... 299 
** Using First-Order Logic ... 300 
*** Assertions and queries in first-order logic ... 301 
*** The kinship domain ... 301 
*** Numbers, sets, and lists ... 303 
*** The wumpus world ... 305 
** Knowledge Engineering in First-Order Logic ... 307 
*** The knowledge-engineering process ... 307 
*** The electronic circuits domain ... 309 
             Identify the task ... 309 
             Assemble the relevant knowledge ... 309 
             Decide on a vocabulary ... 310 
             Encode general knowledge of the domain ... 310 
             Encode the specific problem instance ... 311 
             Pose queries to the inference procedure ... 312 
             Debug the knowledge base ... 312 
** Summary ... 313 
** Bibliographical and Historical Notes ... 313 
** Exercises ... 315
* Inference in First-Order Logic ... 322


** Propositional vs. First-Order Inference ... 322 
*** Inference rules for quantifiers ... 322 
*** Reduction to propositional inference ... 324 
** Unification and Lifting ... 325 
*** A first-order inference rule ... 325 
*** Unification ... 326 
*** Storage and retrieval ... 327 
** Forward Chaining ... 330 
*** First-order definite clauses ... 330 
*** A simple forward-chaining algorithm ... 331 
*** Efficient forward chaining ... 333 
             Matching rules against known facts ... 333 
             Incremental forward chaining ... 335 
             Irrelevant facts ... 336 
** Backward Chaining ... 337 
*** A backward-chaining algorithm ... 337 
*** Logic programming ... 339 
*** Efficient implementation of logic programs ... 340 
