doc/artificial-intelligence-a-modern-approach.html
<div class="outline-text-2" id="text-7">
</div><div id="outline-container-sec-7-1" class="outline-3">
<h3 id="sec-7-1"><span class="section-number-3">7.1</span> Knowledge-Based Agents &#x2026; 235</h3>
</div>
<div id="outline-container-sec-7-2" class="outline-3">
<h3 id="sec-7-2"><span class="section-number-3">7.2</span> The Wumpus World &#x2026; 236</h3>
</div>
<div id="outline-container-sec-7-3" class="outline-3">
<h3 id="sec-7-3"><span class="section-number-3">7.3</span> Logic &#x2026; 240</h3>
</div>
<div id="outline-container-sec-7-4" class="outline-3">
<h3 id="sec-7-4"><span class="section-number-3">7.4</span> Propositional Logic: A Very Simple Logic &#x2026; 243</h3>
<div class="outline-text-3" id="text-7-4">
</div><div id="outline-container-sec-7-4-1" class="outline-4">
<h4 id="sec-7-4-1"><span class="section-number-4">7.4.1</span> Syntax &#x2026; 244</h4>
</div>
<div id="outline-container-sec-7-4-2" class="outline-4">
<h4 id="sec-7-4-2"><span class="section-number-4">7.4.2</span> Semantics &#x2026; 245</h4>
</div>
<div id="outline-container-sec-7-4-3" class="outline-4">
<h4 id="sec-7-4-3"><span class="section-number-4">7.4.3</span> A simple knowledge base &#x2026; 246</h4>
</div>
<div id="outline-container-sec-7-4-4" class="outline-4">
<h4 id="sec-7-4-4"><span class="section-number-4">7.4.4</span> A simple inference procedure &#x2026; 247</h4>
</div>
</div>
<div id="outline-container-sec-7-5" class="outline-3">
<h3 id="sec-7-5"><span class="section-number-3">7.5</span> Propositional Theorem Proving &#x2026; 249</h3>
<div class="outline-text-3" id="text-7-5">
</div><div id="outline-container-sec-7-5-1" class="outline-4">
<h4 id="sec-7-5-1"><span class="section-number-4">7.5.1</span> Inference and proofs &#x2026; 250</h4>
</div>
<div id="outline-container-sec-7-5-2" class="outline-4">
<h4 id="sec-7-5-2"><span class="section-number-4">7.5.2</span> Proof by resolution &#x2026; 252</h4>
<div class="outline-text-4" id="text-7-5-2">
<p>
Conjunctive normal form &#x2026; 253 
A resolution algorithm &#x2026; 254 
Completeness of resolution &#x2026; 255 
</p>
</div>
</div>
<div id="outline-container-sec-7-5-3" class="outline-4">
<h4 id="sec-7-5-3"><span class="section-number-4">7.5.3</span> Horn clauses and definite clauses &#x2026; 256</h4>
</div>
<div id="outline-container-sec-7-5-4" class="outline-4">
<h4 id="sec-7-5-4"><span class="section-number-4">7.5.4</span> Forward and backward chaining &#x2026; 257</h4>
</div>
</div>
<div id="outline-container-sec-7-6" class="outline-3">
<h3 id="sec-7-6"><span class="section-number-3">7.6</span> Effective Propositional Model Checking &#x2026; 259</h3>
<div class="outline-text-3" id="text-7-6">
</div><div id="outline-container-sec-7-6-1" class="outline-4">
<h4 id="sec-7-6-1"><span class="section-number-4">7.6.1</span> A complete backtracking algorithm &#x2026; 260</h4>
</div>
<div id="outline-container-sec-7-6-2" class="outline-4">
<h4 id="sec-7-6-2"><span class="section-number-4">7.6.2</span> Local search algorithms &#x2026; 262</h4>
</div>
<div id="outline-container-sec-7-6-3" class="outline-4">
<h4 id="sec-7-6-3"><span class="section-number-4">7.6.3</span> The landscape of random SAT problems &#x2026; 263</h4>
</div>
</div>
<div id="outline-container-sec-7-7" class="outline-3">
<h3 id="sec-7-7"><span class="section-number-3">7.7</span> Agents Based on Propositional Logic &#x2026; 265</h3>
<div class="outline-text-3" id="text-7-7">
</div><div id="outline-container-sec-7-7-1" class="outline-4">
<h4 id="sec-7-7-1"><span class="section-number-4">7.7.1</span> The current state of the world &#x2026; 265</h4>
</div>
<div id="outline-container-sec-7-7-2" class="outline-4">
<h4 id="sec-7-7-2"><span class="section-number-4">7.7.2</span> A hybrid agent &#x2026; 268</h4>
</div>
<div id="outline-container-sec-7-7-3" class="outline-4">
<h4 id="sec-7-7-3"><span class="section-number-4">7.7.3</span> Logical state estimation &#x2026; 269</h4>
</div>
<div id="outline-container-sec-7-7-4" class="outline-4">
<h4 id="sec-7-7-4"><span class="section-number-4">7.7.4</span> Making plans by propositional inference &#x2026; 271</h4>
</div>
</div>
<div id="outline-container-sec-7-8" class="outline-3">
<h3 id="sec-7-8"><span class="section-number-3">7.8</span> Summary &#x2026; 274</h3>
</div>
<div id="outline-container-sec-7-9" class="outline-3">
<h3 id="sec-7-9"><span class="section-number-3">7.9</span> Bibliographical and Historical Notes &#x2026; 275</h3>
</div>
<div id="outline-container-sec-7-10" class="outline-3">
<h3 id="sec-7-10"><span class="section-number-3">7.10</span> Exercises &#x2026; 279</h3>
</div>
</div>
<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> First-Order Logic &#x2026; 285</h2>
<div class="outline-text-2" id="text-8">
</div><div id="outline-container-sec-8-1" class="outline-3">
<h3 id="sec-8-1"><span class="section-number-3">8.1</span> Representation Revisited &#x2026; 285</h3>
<div class="outline-text-3" id="text-8-1">
</div><div id="outline-container-sec-8-1-1" class="outline-4">
<h4 id="sec-8-1-1"><span class="section-number-4">8.1.1</span> The language of thought &#x2026; 286</h4>
</div>
<div id="outline-container-sec-8-1-2" class="outline-4">
<h4 id="sec-8-1-2"><span class="section-number-4">8.1.2</span> Combining the best of formal and natural languages &#x2026; 288</h4>
</div>
</div>
<div id="outline-container-sec-8-2" class="outline-3">
<h3 id="sec-8-2"><span class="section-number-3">8.2</span> Syntax and Semantics of First-Order Logic &#x2026; 290</h3>
<div class="outline-text-3" id="text-8-2">
</div><div id="outline-container-sec-8-2-1" class="outline-4">
<h4 id="sec-8-2-1"><span class="section-number-4">8.2.1</span> Models for first-order logic &#x2026; 290</h4>
</div>
<div id="outline-container-sec-8-2-2" class="outline-4">
<h4 id="sec-8-2-2"><span class="section-number-4">8.2.2</span> Symbols and interpretations &#x2026; 292</h4>
</div>
<div id="outline-container-sec-8-2-3" class="outline-4">
<h4 id="sec-8-2-3"><span class="section-number-4">8.2.3</span> Terms &#x2026; 294</h4>
</div>
<div id="outline-container-sec-8-2-4" class="outline-4">
<h4 id="sec-8-2-4"><span class="section-number-4">8.2.4</span> Atomic sentences &#x2026; 294</h4>
</div>
<div id="outline-container-sec-8-2-5" class="outline-4">
<h4 id="sec-8-2-5"><span class="section-number-4">8.2.5</span> Complex sentences &#x2026; 295</h4>
</div>
<div id="outline-container-sec-8-2-6" class="outline-4">
<h4 id="sec-8-2-6"><span class="section-number-4">8.2.6</span> Quantifiers &#x2026; 295</h4>
<div class="outline-text-4" id="text-8-2-6">
<p>
Universal quantification () &#x2026; 295 
Existential quantification () &#x2026; 297 
Nested quantifiers &#x2026; 297 
Connections between  and  &#x2026; 298 
</p>
</div>
</div>
<div id="outline-container-sec-8-2-7" class="outline-4">
<h4 id="sec-8-2-7"><span class="section-number-4">8.2.7</span> Equality &#x2026; 299</h4>
</div>
<div id="outline-container-sec-8-2-8" class="outline-4">
<h4 id="sec-8-2-8"><span class="section-number-4">8.2.8</span> An alternative semantics? &#x2026; 299</h4>
</div>
</div>
<div id="outline-container-sec-8-3" class="outline-3">
<h3 id="sec-8-3"><span class="section-number-3">8.3</span> Using First-Order Logic &#x2026; 300</h3>
<div class="outline-text-3" id="text-8-3">
</div><div id="outline-container-sec-8-3-1" class="outline-4">
<h4 id="sec-8-3-1"><span class="section-number-4">8.3.1</span> Assertions and queries in first-order logic &#x2026; 301</h4>
</div>
<div id="outline-container-sec-8-3-2" class="outline-4">
<h4 id="sec-8-3-2"><span class="section-number-4">8.3.2</span> The kinship domain &#x2026; 301</h4>
</div>
<div id="outline-container-sec-8-3-3" class="outline-4">
<h4 id="sec-8-3-3"><span class="section-number-4">8.3.3</span> Numbers, sets, and lists &#x2026; 303</h4>
</div>
<div id="outline-container-sec-8-3-4" class="outline-4">
<h4 id="sec-8-3-4"><span class="section-number-4">8.3.4</span> The wumpus world &#x2026; 305</h4>
</div>
</div>
<div id="outline-container-sec-8-4" class="outline-3">
<h3 id="sec-8-4"><span class="section-number-3">8.4</span> Knowledge Engineering in First-Order Logic &#x2026; 307</h3>
<div class="outline-text-3" id="text-8-4">
</div><div id="outline-container-sec-8-4-1" class="outline-4">
<h4 id="sec-8-4-1"><span class="section-number-4">8.4.1</span> The knowledge-engineering process &#x2026; 307</h4>
</div>
<div id="outline-container-sec-8-4-2" class="outline-4">
<h4 id="sec-8-4-2"><span class="section-number-4">8.4.2</span> The electronic circuits domain &#x2026; 309</h4>
<div class="outline-text-4" id="text-8-4-2">
<p>
Identify the task &#x2026; 309 
Assemble the relevant knowledge &#x2026; 309 
Decide on a vocabulary &#x2026; 310 
Encode general knowledge of the domain &#x2026; 310 
Encode the specific problem instance &#x2026; 311 
Pose queries to the inference procedure &#x2026; 312 
Debug the knowledge base &#x2026; 312 
</p>
</div>
</div>
</div>
<div id="outline-container-sec-8-5" class="outline-3">
<h3 id="sec-8-5"><span class="section-number-3">8.5</span> Summary &#x2026; 313</h3>
</div>
<div id="outline-container-sec-8-6" class="outline-3">
<h3 id="sec-8-6"><span class="section-number-3">8.6</span> Bibliographical and Historical Notes &#x2026; 313</h3>
</div>
<div id="outline-container-sec-8-7" class="outline-3">
<h3 id="sec-8-7"><span class="section-number-3">8.7</span> Exercises &#x2026; 315</h3>
</div>
</div>
<div id="outline-container-sec-9" class="outline-2">
<h2 id="sec-9"><span class="section-number-2">9</span> Inference in First-Order Logic &#x2026; 322</h2>
<div class="outline-text-2" id="text-9">
</div><div id="outline-container-sec-9-1" class="outline-3">
<h3 id="sec-9-1"><span class="section-number-3">9.1</span> Propositional vs. First-Order Inference &#x2026; 322</h3>
<div class="outline-text-3" id="text-9-1">
</div><div id="outline-container-sec-9-1-1" class="outline-4">
<h4 id="sec-9-1-1"><span class="section-number-4">9.1.1</span> Inference rules for quantifiers &#x2026; 322</h4>
</div>
<div id="outline-container-sec-9-1-2" class="outline-4">
<h4 id="sec-9-1-2"><span class="section-number-4">9.1.2</span> Reduction to propositional inference &#x2026; 324</h4>
</div>
</div>
<div id="outline-container-sec-9-2" class="outline-3">
<h3 id="sec-9-2"><span class="section-number-3">9.2</span> Unification and Lifting &#x2026; 325</h3>
<div class="outline-text-3" id="text-9-2">
</div><div id="outline-container-sec-9-2-1" class="outline-4">
<h4 id="sec-9-2-1"><span class="section-number-4">9.2.1</span> A first-order inference rule &#x2026; 325</h4>
</div>
<div id="outline-container-sec-9-2-2" class="outline-4">
<h4 id="sec-9-2-2"><span class="section-number-4">9.2.2</span> Unification &#x2026; 326</h4>
</div>
<div id="outline-container-sec-9-2-3" class="outline-4">
<h4 id="sec-9-2-3"><span class="section-number-4">9.2.3</span> Storage and retrieval &#x2026; 327</h4>
</div>
</div>
<div id="outline-container-sec-9-3" class="outline-3">
<h3 id="sec-9-3"><span class="section-number-3">9.3</span> Forward Chaining &#x2026; 330</h3>
<div class="outline-text-3" id="text-9-3">
</div><div id="outline-container-sec-9-3-1" class="outline-4">
<h4 id="sec-9-3-1"><span class="section-number-4">9.3.1</span> First-order definite clauses &#x2026; 330</h4>
</div>
<div id="outline-container-sec-9-3-2" class="outline-4">
<h4 id="sec-9-3-2"><span class="section-number-4">9.3.2</span> A simple forward-chaining algorithm &#x2026; 331</h4>
</div>
<div id="outline-container-sec-9-3-3" class="outline-4">
<h4 id="sec-9-3-3"><span class="section-number-4">9.3.3</span> Efficient forward chaining &#x2026; 333</h4>
<div class="outline-text-4" id="text-9-3-3">
<p>
Matching rules against known facts &#x2026; 333 
Incremental forward chaining &#x2026; 335 
Irrelevant facts &#x2026; 336 
</p>
</div>
</div>
</div>
<div id="outline-container-sec-9-4" class="outline-3">
<h3 id="sec-9-4"><span class="section-number-3">9.4</span> Backward Chaining &#x2026; 337</h3>
<div class="outline-text-3" id="text-9-4">
</div><div id="outline-container-sec-9-4-1" class="outline-4">
<h4 id="sec-9-4-1"><span class="section-number-4">9.4.1</span> A backward-chaining algorithm &#x2026; 337</h4>
</div>
<div id="outline-container-sec-9-4-2" class="outline-4">
<h4 id="sec-9-4-2"><span class="section-number-4">9.4.2</span> Logic programming &#x2026; 339</h4>
</div>
<div id="outline-container-sec-9-4-3" class="outline-4">
<h4 id="sec-9-4-3"><span class="section-number-4">9.4.3</span> Efficient implementation of logic programs &#x2026; 340</h4>
</div>
