doc/org/artificial-intelligence-a-modern-approach.org
*** Redundant inference and infinite loops ... 342 
*** Database semantics of Prolog ... 343 
*** Constraint logic programming ... 344 
** Resolution ... 345 
*** Conjunctive normal form for first-order logic ... 345 
*** The resolution inference rule ... 347 
*** Example proofs ... 347 
*** Completeness of resolution ... 350 
*** Equality ... 353 
*** Resolution strategies ... 355 
             Practical uses of resolution theorem provers ... 356 
**  Summary ... 357 
** Bibliographical and Historical Notes ... 357 
** Exercises ... 360

* Chapter 10: Classical Planning ... 366


** Definition of Classical Planning ... 366 
*** Example: Air cargo transport ... 369 
*** Example: The spare tire problem ... 370 
*** Example: The blocks world ... 370 
*** The complexity of classical planning ... 372 
** Algorithms for Planning as State-Space Search ... 373 
*** Forward (progression) state-space search ... 373 
*** Backward (regression) relevant-states search ... 374 
*** Heuristics for planning ... 376 
** Planning Graphs ... 379 
*** Planning graphs for heuristic estimation ... 381 
*** The Graphplan algorithm ... 383 
*** Termination of Graphplan ... 385 
** Other Classical Planning Approaches ... 387 
*** Classical planning as Boolean satisfiability ... 387 
*** Planning as first-order logical deduction: Situation calculus ... 388 
*** Planning as constraint satisfaction ... 390 
*** Planning as refinement of partially ordered plans ... 390 
** Analysis of Planning Approaches ... 392 
** Summary ... 393 
** Bibliographical and Historical Notes ... 393 
** Exercises ... 396
* Planning and Acting in the Real World ... 401


** Time, Schedules, and Resources ... 401 
*** Representing temporal and resource constraints ... 402 
*** Solving scheduling problems ... 403 
** Hierarchical Planning ... 406 
*** High-level actions ... 406 
*** Searching for primitive solutions ... 408 
*** Searching for abstract solutions ... 410 
** Planning and Acting in Nondeterministic Domains ... 415 
*** Sensorless planning ... 417 
*** Contingent planning ... 421 
*** Online replanning ... 422 
** Multiagent Planning ... 425 
*** Planning with multiple simultaneous actions ... 426 
*** Planning with multiple agents: Cooperation and coordination ... 428 
** Summary ... 430 
** Bibliographical and Historical Notes ... 431 
** Exercises ... 435
* Knowledge Representation ... 437


** Ontological Engineering ... 437 
** Categories and Objects ... 440 
*** Physical composition ... 441 
*** Measurements ... 444 
*** Objects: Things and stuff ... 445 
** Events ... 446 
*** Processes ... 447 
*** Time intervals ... 448 
*** Fluents and objects ... 449 
** Mental Events and Mental Objects ... 450 
** Reasoning Systems for Categories ... 453 
*** Semantic networks ... 454 
*** Description logics ... 456 
** Reasoning with Default Information ... 458 
*** Circumscription and default logic ... 458 
