doc/artificial-intelligence-a-modern-approach.html
<div id="outline-container-sec-9-4-4" class="outline-4">
<h4 id="sec-9-4-4"><span class="section-number-4">9.4.4</span> Redundant inference and infinite loops &#x2026; 342</h4>
</div>
<div id="outline-container-sec-9-4-5" class="outline-4">
<h4 id="sec-9-4-5"><span class="section-number-4">9.4.5</span> Database semantics of Prolog &#x2026; 343</h4>
</div>
<div id="outline-container-sec-9-4-6" class="outline-4">
<h4 id="sec-9-4-6"><span class="section-number-4">9.4.6</span> Constraint logic programming &#x2026; 344</h4>
</div>
</div>
<div id="outline-container-sec-9-5" class="outline-3">
<h3 id="sec-9-5"><span class="section-number-3">9.5</span> Resolution &#x2026; 345</h3>
<div class="outline-text-3" id="text-9-5">
</div><div id="outline-container-sec-9-5-1" class="outline-4">
<h4 id="sec-9-5-1"><span class="section-number-4">9.5.1</span> Conjunctive normal form for first-order logic &#x2026; 345</h4>
</div>
<div id="outline-container-sec-9-5-2" class="outline-4">
<h4 id="sec-9-5-2"><span class="section-number-4">9.5.2</span> The resolution inference rule &#x2026; 347</h4>
</div>
<div id="outline-container-sec-9-5-3" class="outline-4">
<h4 id="sec-9-5-3"><span class="section-number-4">9.5.3</span> Example proofs &#x2026; 347</h4>
</div>
<div id="outline-container-sec-9-5-4" class="outline-4">
<h4 id="sec-9-5-4"><span class="section-number-4">9.5.4</span> Completeness of resolution &#x2026; 350</h4>
</div>
<div id="outline-container-sec-9-5-5" class="outline-4">
<h4 id="sec-9-5-5"><span class="section-number-4">9.5.5</span> Equality &#x2026; 353</h4>
</div>
<div id="outline-container-sec-9-5-6" class="outline-4">
<h4 id="sec-9-5-6"><span class="section-number-4">9.5.6</span> Resolution strategies &#x2026; 355</h4>
<div class="outline-text-4" id="text-9-5-6">
<p>
Practical uses of resolution theorem provers &#x2026; 356 
</p>
</div>
</div>
</div>
<div id="outline-container-sec-9-6" class="outline-3">
<h3 id="sec-9-6"><span class="section-number-3">9.6</span> Summary &#x2026; 357</h3>
</div>
<div id="outline-container-sec-9-7" class="outline-3">
<h3 id="sec-9-7"><span class="section-number-3">9.7</span> Bibliographical and Historical Notes &#x2026; 357</h3>
</div>
<div id="outline-container-sec-9-8" class="outline-3">
<h3 id="sec-9-8"><span class="section-number-3">9.8</span> Exercises &#x2026; 360</h3>
</div>
</div>

<div id="outline-container-sec-10" class="outline-2">
<h2 id="sec-10"><span class="section-number-2">10</span> Chapter 10: Classical Planning &#x2026; 366</h2>
<div class="outline-text-2" id="text-10">
</div><div id="outline-container-sec-10-1" class="outline-3">
<h3 id="sec-10-1"><span class="section-number-3">10.1</span> Definition of Classical Planning &#x2026; 366</h3>
<div class="outline-text-3" id="text-10-1">
</div><div id="outline-container-sec-10-1-1" class="outline-4">
<h4 id="sec-10-1-1"><span class="section-number-4">10.1.1</span> Example: Air cargo transport &#x2026; 369</h4>
</div>
<div id="outline-container-sec-10-1-2" class="outline-4">
<h4 id="sec-10-1-2"><span class="section-number-4">10.1.2</span> Example: The spare tire problem &#x2026; 370</h4>
</div>
<div id="outline-container-sec-10-1-3" class="outline-4">
<h4 id="sec-10-1-3"><span class="section-number-4">10.1.3</span> Example: The blocks world &#x2026; 370</h4>
</div>
<div id="outline-container-sec-10-1-4" class="outline-4">
<h4 id="sec-10-1-4"><span class="section-number-4">10.1.4</span> The complexity of classical planning &#x2026; 372</h4>
</div>
</div>
<div id="outline-container-sec-10-2" class="outline-3">
<h3 id="sec-10-2"><span class="section-number-3">10.2</span> Algorithms for Planning as State-Space Search &#x2026; 373</h3>
<div class="outline-text-3" id="text-10-2">
</div><div id="outline-container-sec-10-2-1" class="outline-4">
<h4 id="sec-10-2-1"><span class="section-number-4">10.2.1</span> Forward (progression) state-space search &#x2026; 373</h4>
</div>
<div id="outline-container-sec-10-2-2" class="outline-4">
<h4 id="sec-10-2-2"><span class="section-number-4">10.2.2</span> Backward (regression) relevant-states search &#x2026; 374</h4>
</div>
<div id="outline-container-sec-10-2-3" class="outline-4">
<h4 id="sec-10-2-3"><span class="section-number-4">10.2.3</span> Heuristics for planning &#x2026; 376</h4>
</div>
</div>
<div id="outline-container-sec-10-3" class="outline-3">
<h3 id="sec-10-3"><span class="section-number-3">10.3</span> Planning Graphs &#x2026; 379</h3>
<div class="outline-text-3" id="text-10-3">
</div><div id="outline-container-sec-10-3-1" class="outline-4">
<h4 id="sec-10-3-1"><span class="section-number-4">10.3.1</span> Planning graphs for heuristic estimation &#x2026; 381</h4>
</div>
<div id="outline-container-sec-10-3-2" class="outline-4">
<h4 id="sec-10-3-2"><span class="section-number-4">10.3.2</span> The Graphplan algorithm &#x2026; 383</h4>
</div>
<div id="outline-container-sec-10-3-3" class="outline-4">
<h4 id="sec-10-3-3"><span class="section-number-4">10.3.3</span> Termination of Graphplan &#x2026; 385</h4>
</div>
</div>
<div id="outline-container-sec-10-4" class="outline-3">
<h3 id="sec-10-4"><span class="section-number-3">10.4</span> Other Classical Planning Approaches &#x2026; 387</h3>
<div class="outline-text-3" id="text-10-4">
</div><div id="outline-container-sec-10-4-1" class="outline-4">
<h4 id="sec-10-4-1"><span class="section-number-4">10.4.1</span> Classical planning as Boolean satisfiability &#x2026; 387</h4>
</div>
<div id="outline-container-sec-10-4-2" class="outline-4">
<h4 id="sec-10-4-2"><span class="section-number-4">10.4.2</span> Planning as first-order logical deduction: Situation calculus &#x2026; 388</h4>
</div>
<div id="outline-container-sec-10-4-3" class="outline-4">
<h4 id="sec-10-4-3"><span class="section-number-4">10.4.3</span> Planning as constraint satisfaction &#x2026; 390</h4>
</div>
<div id="outline-container-sec-10-4-4" class="outline-4">
<h4 id="sec-10-4-4"><span class="section-number-4">10.4.4</span> Planning as refinement of partially ordered plans &#x2026; 390</h4>
</div>
</div>
<div id="outline-container-sec-10-5" class="outline-3">
<h3 id="sec-10-5"><span class="section-number-3">10.5</span> Analysis of Planning Approaches &#x2026; 392</h3>
</div>
<div id="outline-container-sec-10-6" class="outline-3">
<h3 id="sec-10-6"><span class="section-number-3">10.6</span> Summary &#x2026; 393</h3>
</div>
<div id="outline-container-sec-10-7" class="outline-3">
<h3 id="sec-10-7"><span class="section-number-3">10.7</span> Bibliographical and Historical Notes &#x2026; 393</h3>
</div>
<div id="outline-container-sec-10-8" class="outline-3">
<h3 id="sec-10-8"><span class="section-number-3">10.8</span> Exercises &#x2026; 396</h3>
</div>
</div>
<div id="outline-container-sec-11" class="outline-2">
<h2 id="sec-11"><span class="section-number-2">11</span> Planning and Acting in the Real World &#x2026; 401</h2>
<div class="outline-text-2" id="text-11">
</div><div id="outline-container-sec-11-1" class="outline-3">
<h3 id="sec-11-1"><span class="section-number-3">11.1</span> Time, Schedules, and Resources &#x2026; 401</h3>
<div class="outline-text-3" id="text-11-1">
</div><div id="outline-container-sec-11-1-1" class="outline-4">
<h4 id="sec-11-1-1"><span class="section-number-4">11.1.1</span> Representing temporal and resource constraints &#x2026; 402</h4>
</div>
<div id="outline-container-sec-11-1-2" class="outline-4">
<h4 id="sec-11-1-2"><span class="section-number-4">11.1.2</span> Solving scheduling problems &#x2026; 403</h4>
</div>
</div>
<div id="outline-container-sec-11-2" class="outline-3">
<h3 id="sec-11-2"><span class="section-number-3">11.2</span> Hierarchical Planning &#x2026; 406</h3>
<div class="outline-text-3" id="text-11-2">
</div><div id="outline-container-sec-11-2-1" class="outline-4">
<h4 id="sec-11-2-1"><span class="section-number-4">11.2.1</span> High-level actions &#x2026; 406</h4>
</div>
<div id="outline-container-sec-11-2-2" class="outline-4">
<h4 id="sec-11-2-2"><span class="section-number-4">11.2.2</span> Searching for primitive solutions &#x2026; 408</h4>
</div>
<div id="outline-container-sec-11-2-3" class="outline-4">
<h4 id="sec-11-2-3"><span class="section-number-4">11.2.3</span> Searching for abstract solutions &#x2026; 410</h4>
</div>
</div>
<div id="outline-container-sec-11-3" class="outline-3">
<h3 id="sec-11-3"><span class="section-number-3">11.3</span> Planning and Acting in Nondeterministic Domains &#x2026; 415</h3>
<div class="outline-text-3" id="text-11-3">
</div><div id="outline-container-sec-11-3-1" class="outline-4">
<h4 id="sec-11-3-1"><span class="section-number-4">11.3.1</span> Sensorless planning &#x2026; 417</h4>
</div>
<div id="outline-container-sec-11-3-2" class="outline-4">
<h4 id="sec-11-3-2"><span class="section-number-4">11.3.2</span> Contingent planning &#x2026; 421</h4>
</div>
<div id="outline-container-sec-11-3-3" class="outline-4">
<h4 id="sec-11-3-3"><span class="section-number-4">11.3.3</span> Online replanning &#x2026; 422</h4>
</div>
</div>
<div id="outline-container-sec-11-4" class="outline-3">
<h3 id="sec-11-4"><span class="section-number-3">11.4</span> Multiagent Planning &#x2026; 425</h3>
<div class="outline-text-3" id="text-11-4">
</div><div id="outline-container-sec-11-4-1" class="outline-4">
<h4 id="sec-11-4-1"><span class="section-number-4">11.4.1</span> Planning with multiple simultaneous actions &#x2026; 426</h4>
</div>
<div id="outline-container-sec-11-4-2" class="outline-4">
<h4 id="sec-11-4-2"><span class="section-number-4">11.4.2</span> Planning with multiple agents: Cooperation and coordination &#x2026; 428</h4>
</div>
</div>
<div id="outline-container-sec-11-5" class="outline-3">
<h3 id="sec-11-5"><span class="section-number-3">11.5</span> Summary &#x2026; 430</h3>
</div>
<div id="outline-container-sec-11-6" class="outline-3">
<h3 id="sec-11-6"><span class="section-number-3">11.6</span> Bibliographical and Historical Notes &#x2026; 431</h3>
</div>
<div id="outline-container-sec-11-7" class="outline-3">
<h3 id="sec-11-7"><span class="section-number-3">11.7</span> Exercises &#x2026; 435</h3>
</div>
</div>
<div id="outline-container-sec-12" class="outline-2">
<h2 id="sec-12"><span class="section-number-2">12</span> Knowledge Representation &#x2026; 437</h2>
<div class="outline-text-2" id="text-12">
</div><div id="outline-container-sec-12-1" class="outline-3">
<h3 id="sec-12-1"><span class="section-number-3">12.1</span> Ontological Engineering &#x2026; 437</h3>
</div>
<div id="outline-container-sec-12-2" class="outline-3">
<h3 id="sec-12-2"><span class="section-number-3">12.2</span> Categories and Objects &#x2026; 440</h3>
<div class="outline-text-3" id="text-12-2">
</div><div id="outline-container-sec-12-2-1" class="outline-4">
<h4 id="sec-12-2-1"><span class="section-number-4">12.2.1</span> Physical composition &#x2026; 441</h4>
</div>
<div id="outline-container-sec-12-2-2" class="outline-4">
<h4 id="sec-12-2-2"><span class="section-number-4">12.2.2</span> Measurements &#x2026; 444</h4>
</div>
<div id="outline-container-sec-12-2-3" class="outline-4">
<h4 id="sec-12-2-3"><span class="section-number-4">12.2.3</span> Objects: Things and stuff &#x2026; 445</h4>
</div>
</div>
<div id="outline-container-sec-12-3" class="outline-3">
<h3 id="sec-12-3"><span class="section-number-3">12.3</span> Events &#x2026; 446</h3>
<div class="outline-text-3" id="text-12-3">
</div><div id="outline-container-sec-12-3-1" class="outline-4">
<h4 id="sec-12-3-1"><span class="section-number-4">12.3.1</span> Processes &#x2026; 447</h4>
</div>
<div id="outline-container-sec-12-3-2" class="outline-4">
<h4 id="sec-12-3-2"><span class="section-number-4">12.3.2</span> Time intervals &#x2026; 448</h4>
</div>
<div id="outline-container-sec-12-3-3" class="outline-4">
<h4 id="sec-12-3-3"><span class="section-number-4">12.3.3</span> Fluents and objects &#x2026; 449</h4>
</div>
</div>
<div id="outline-container-sec-12-4" class="outline-3">
<h3 id="sec-12-4"><span class="section-number-3">12.4</span> Mental Events and Mental Objects &#x2026; 450</h3>
</div>
<div id="outline-container-sec-12-5" class="outline-3">
<h3 id="sec-12-5"><span class="section-number-3">12.5</span> Reasoning Systems for Categories &#x2026; 453</h3>
<div class="outline-text-3" id="text-12-5">
</div><div id="outline-container-sec-12-5-1" class="outline-4">
<h4 id="sec-12-5-1"><span class="section-number-4">12.5.1</span> Semantic networks &#x2026; 454</h4>
</div>
<div id="outline-container-sec-12-5-2" class="outline-4">
<h4 id="sec-12-5-2"><span class="section-number-4">12.5.2</span> Description logics &#x2026; 456</h4>
</div>
</div>
<div id="outline-container-sec-12-6" class="outline-3">
<h3 id="sec-12-6"><span class="section-number-3">12.6</span> Reasoning with Default Information &#x2026; 458</h3>
<div class="outline-text-3" id="text-12-6">
</div><div id="outline-container-sec-12-6-1" class="outline-4">
<h4 id="sec-12-6-1"><span class="section-number-4">12.6.1</span> Circumscription and default logic &#x2026; 458</h4>
</div>
