doc/org/artificial-intelligence-a-modern-approach.org
*** Truth maintenance systems ... 460 
** The Internet Shopping World ... 462 
*** Following links ... 464 
*** Comparing offers ... 466 
** Summary ... 467 
** Bibliographical and Historical Notes ... 468 
** Exercises ... 473

* Quantifying Uncertainty ... 480


** Acting under Uncertainty ... 480 
*** Summarizing uncertainty ... 481 
*** Uncertainty and rational decisions ... 482 
** Basic Probability Notation ... 483 
*** What probabilities are about ... 484 
*** The language of propositions in probability assertions ... 486 
*** Probability axioms and their reasonableness ... 488 
** Inference Using Full Joint Distributions ... 490 
** Independence ... 494 
** Bayes' Rule and Its Use ... 495 
*** Applying Bayes' rule: The simple case ... 496 
*** Using Bayes' rule: Combining evidence ... 497 
** The Wumpus World Revisited ... 499 
** Summary ... 503 
** Bibliographical and Historical Notes ... 503 
** Exercises ... 506
* Probabilistic Reasoning ... 510


** Representing Knowledge in an Uncertain Domain ... 510 
** The Semantics of Bayesian Networks ... 513 
*** Representing the full joint distribution ... 513 
             A method for constructing Bayesian networks ... 514 
             Compactness and node ordering ... 515 
*** Conditional independence relations in Bayesian networks ... 517 
** Efficient Representation of Conditional Distributions ... 518 
             Bayesian nets with continuous variables ... 519 
** Exact Inference in Bayesian Networks ... 522 
*** Inference by enumeration ... 523 
*** The variable elimination algorithm ... 524 
             Operations on factors ... 526 
             Variable ordering and variable relevance ... 527 
*** The complexity of exact inference ... 528 
*** Clustering algorithms ... 529 
** Approximate Inference in Bayesian Networks ... 530 
*** Direct sampling methods ... 530 
             Rejection sampling in Bayesian networks ... 532 
             Likelihood weighting ... 532 
*** Inference by Markov chain simulation ... 535 
             Gibbs sampling in Bayesian networks ... 536 
             Why Gibbs sampling works ... 536 
** Relational and First-Order Probability Models ... 539 
*** Possible worlds ... 540 
*** Relational probability models ... 542 
*** Open-universe probability models ... 544 
** Other Approaches to Uncertain Reasoning ... 546 
*** Rule-based methods for uncertain reasoning ... 547 
*** Representing ignorance: Dempster--Shafer theory ... 549 
*** Representing vagueness: Fuzzy sets and fuzzy logic ... 550 
** Summary ... 551 
** Bibliographical and Historical Notes ... 552 
** Exercises ... 558
* Probabilistic Reasoning over Time ... 566


** Time and Uncertainty ... 566 
*** States and observations ... 567 
*** Transition and sensor models ... 568 
** Inference in Temporal Models ... 570 
*** Filtering and prediction ... 571 
*** Smoothing ... 574 
*** Finding the most likely sequence ... 576 
** Hidden Markov Models ... 578 
*** Simplified matrix algorithms ... 579 
*** Hidden Markov model example: Localization ... 581 
** Kalman Filters ... 584 
*** Updating Gaussian distributions ... 584 
*** A simple one-dimensional example ... 585 
*** The general case ... 587 
