doc/artificial-intelligence-a-modern-approach.html
<div id="outline-container-sec-12-6-2" class="outline-4">
<h4 id="sec-12-6-2"><span class="section-number-4">12.6.2</span> Truth maintenance systems &#x2026; 460</h4>
</div>
</div>
<div id="outline-container-sec-12-7" class="outline-3">
<h3 id="sec-12-7"><span class="section-number-3">12.7</span> The Internet Shopping World &#x2026; 462</h3>
<div class="outline-text-3" id="text-12-7">
</div><div id="outline-container-sec-12-7-1" class="outline-4">
<h4 id="sec-12-7-1"><span class="section-number-4">12.7.1</span> Following links &#x2026; 464</h4>
</div>
<div id="outline-container-sec-12-7-2" class="outline-4">
<h4 id="sec-12-7-2"><span class="section-number-4">12.7.2</span> Comparing offers &#x2026; 466</h4>
</div>
</div>
<div id="outline-container-sec-12-8" class="outline-3">
<h3 id="sec-12-8"><span class="section-number-3">12.8</span> Summary &#x2026; 467</h3>
</div>
<div id="outline-container-sec-12-9" class="outline-3">
<h3 id="sec-12-9"><span class="section-number-3">12.9</span> Bibliographical and Historical Notes &#x2026; 468</h3>
</div>
<div id="outline-container-sec-12-10" class="outline-3">
<h3 id="sec-12-10"><span class="section-number-3">12.10</span> Exercises &#x2026; 473</h3>
</div>
</div>

<div id="outline-container-sec-13" class="outline-2">
<h2 id="sec-13"><span class="section-number-2">13</span> Quantifying Uncertainty &#x2026; 480</h2>
<div class="outline-text-2" id="text-13">
</div><div id="outline-container-sec-13-1" class="outline-3">
<h3 id="sec-13-1"><span class="section-number-3">13.1</span> Acting under Uncertainty &#x2026; 480</h3>
<div class="outline-text-3" id="text-13-1">
</div><div id="outline-container-sec-13-1-1" class="outline-4">
<h4 id="sec-13-1-1"><span class="section-number-4">13.1.1</span> Summarizing uncertainty &#x2026; 481</h4>
</div>
<div id="outline-container-sec-13-1-2" class="outline-4">
<h4 id="sec-13-1-2"><span class="section-number-4">13.1.2</span> Uncertainty and rational decisions &#x2026; 482</h4>
</div>
</div>
<div id="outline-container-sec-13-2" class="outline-3">
<h3 id="sec-13-2"><span class="section-number-3">13.2</span> Basic Probability Notation &#x2026; 483</h3>
<div class="outline-text-3" id="text-13-2">
</div><div id="outline-container-sec-13-2-1" class="outline-4">
<h4 id="sec-13-2-1"><span class="section-number-4">13.2.1</span> What probabilities are about &#x2026; 484</h4>
</div>
<div id="outline-container-sec-13-2-2" class="outline-4">
<h4 id="sec-13-2-2"><span class="section-number-4">13.2.2</span> The language of propositions in probability assertions &#x2026; 486</h4>
</div>
<div id="outline-container-sec-13-2-3" class="outline-4">
<h4 id="sec-13-2-3"><span class="section-number-4">13.2.3</span> Probability axioms and their reasonableness &#x2026; 488</h4>
</div>
</div>
<div id="outline-container-sec-13-3" class="outline-3">
<h3 id="sec-13-3"><span class="section-number-3">13.3</span> Inference Using Full Joint Distributions &#x2026; 490</h3>
</div>
<div id="outline-container-sec-13-4" class="outline-3">
<h3 id="sec-13-4"><span class="section-number-3">13.4</span> Independence &#x2026; 494</h3>
</div>
<div id="outline-container-sec-13-5" class="outline-3">
<h3 id="sec-13-5"><span class="section-number-3">13.5</span> Bayes' Rule and Its Use &#x2026; 495</h3>
<div class="outline-text-3" id="text-13-5">
</div><div id="outline-container-sec-13-5-1" class="outline-4">
<h4 id="sec-13-5-1"><span class="section-number-4">13.5.1</span> Applying Bayes' rule: The simple case &#x2026; 496</h4>
</div>
<div id="outline-container-sec-13-5-2" class="outline-4">
<h4 id="sec-13-5-2"><span class="section-number-4">13.5.2</span> Using Bayes' rule: Combining evidence &#x2026; 497</h4>
</div>
</div>
<div id="outline-container-sec-13-6" class="outline-3">
<h3 id="sec-13-6"><span class="section-number-3">13.6</span> The Wumpus World Revisited &#x2026; 499</h3>
</div>
<div id="outline-container-sec-13-7" class="outline-3">
<h3 id="sec-13-7"><span class="section-number-3">13.7</span> Summary &#x2026; 503</h3>
</div>
<div id="outline-container-sec-13-8" class="outline-3">
<h3 id="sec-13-8"><span class="section-number-3">13.8</span> Bibliographical and Historical Notes &#x2026; 503</h3>
</div>
<div id="outline-container-sec-13-9" class="outline-3">
<h3 id="sec-13-9"><span class="section-number-3">13.9</span> Exercises &#x2026; 506</h3>
</div>
</div>
<div id="outline-container-sec-14" class="outline-2">
<h2 id="sec-14"><span class="section-number-2">14</span> Probabilistic Reasoning &#x2026; 510</h2>
<div class="outline-text-2" id="text-14">
</div><div id="outline-container-sec-14-1" class="outline-3">
<h3 id="sec-14-1"><span class="section-number-3">14.1</span> Representing Knowledge in an Uncertain Domain &#x2026; 510</h3>
</div>
<div id="outline-container-sec-14-2" class="outline-3">
<h3 id="sec-14-2"><span class="section-number-3">14.2</span> The Semantics of Bayesian Networks &#x2026; 513</h3>
<div class="outline-text-3" id="text-14-2">
</div><div id="outline-container-sec-14-2-1" class="outline-4">
<h4 id="sec-14-2-1"><span class="section-number-4">14.2.1</span> Representing the full joint distribution &#x2026; 513</h4>
<div class="outline-text-4" id="text-14-2-1">
<p>
A method for constructing Bayesian networks &#x2026; 514 
Compactness and node ordering &#x2026; 515 
</p>
</div>
</div>
<div id="outline-container-sec-14-2-2" class="outline-4">
<h4 id="sec-14-2-2"><span class="section-number-4">14.2.2</span> Conditional independence relations in Bayesian networks &#x2026; 517</h4>
</div>
</div>
<div id="outline-container-sec-14-3" class="outline-3">
<h3 id="sec-14-3"><span class="section-number-3">14.3</span> Efficient Representation of Conditional Distributions &#x2026; 518</h3>
<div class="outline-text-3" id="text-14-3">
<p>
Bayesian nets with continuous variables &#x2026; 519 
</p>
</div>
</div>
<div id="outline-container-sec-14-4" class="outline-3">
<h3 id="sec-14-4"><span class="section-number-3">14.4</span> Exact Inference in Bayesian Networks &#x2026; 522</h3>
<div class="outline-text-3" id="text-14-4">
</div><div id="outline-container-sec-14-4-1" class="outline-4">
<h4 id="sec-14-4-1"><span class="section-number-4">14.4.1</span> Inference by enumeration &#x2026; 523</h4>
</div>
<div id="outline-container-sec-14-4-2" class="outline-4">
<h4 id="sec-14-4-2"><span class="section-number-4">14.4.2</span> The variable elimination algorithm &#x2026; 524</h4>
<div class="outline-text-4" id="text-14-4-2">
<p>
Operations on factors &#x2026; 526 
Variable ordering and variable relevance &#x2026; 527 
</p>
</div>
</div>
<div id="outline-container-sec-14-4-3" class="outline-4">
<h4 id="sec-14-4-3"><span class="section-number-4">14.4.3</span> The complexity of exact inference &#x2026; 528</h4>
</div>
<div id="outline-container-sec-14-4-4" class="outline-4">
<h4 id="sec-14-4-4"><span class="section-number-4">14.4.4</span> Clustering algorithms &#x2026; 529</h4>
</div>
</div>
<div id="outline-container-sec-14-5" class="outline-3">
<h3 id="sec-14-5"><span class="section-number-3">14.5</span> Approximate Inference in Bayesian Networks &#x2026; 530</h3>
<div class="outline-text-3" id="text-14-5">
</div><div id="outline-container-sec-14-5-1" class="outline-4">
<h4 id="sec-14-5-1"><span class="section-number-4">14.5.1</span> Direct sampling methods &#x2026; 530</h4>
<div class="outline-text-4" id="text-14-5-1">
<p>
Rejection sampling in Bayesian networks &#x2026; 532 
Likelihood weighting &#x2026; 532 
</p>
</div>
</div>
<div id="outline-container-sec-14-5-2" class="outline-4">
<h4 id="sec-14-5-2"><span class="section-number-4">14.5.2</span> Inference by Markov chain simulation &#x2026; 535</h4>
<div class="outline-text-4" id="text-14-5-2">
<p>
Gibbs sampling in Bayesian networks &#x2026; 536 
Why Gibbs sampling works &#x2026; 536 
</p>
</div>
</div>
</div>
<div id="outline-container-sec-14-6" class="outline-3">
<h3 id="sec-14-6"><span class="section-number-3">14.6</span> Relational and First-Order Probability Models &#x2026; 539</h3>
<div class="outline-text-3" id="text-14-6">
</div><div id="outline-container-sec-14-6-1" class="outline-4">
<h4 id="sec-14-6-1"><span class="section-number-4">14.6.1</span> Possible worlds &#x2026; 540</h4>
</div>
<div id="outline-container-sec-14-6-2" class="outline-4">
<h4 id="sec-14-6-2"><span class="section-number-4">14.6.2</span> Relational probability models &#x2026; 542</h4>
</div>
<div id="outline-container-sec-14-6-3" class="outline-4">
<h4 id="sec-14-6-3"><span class="section-number-4">14.6.3</span> Open-universe probability models &#x2026; 544</h4>
</div>
</div>
<div id="outline-container-sec-14-7" class="outline-3">
<h3 id="sec-14-7"><span class="section-number-3">14.7</span> Other Approaches to Uncertain Reasoning &#x2026; 546</h3>
<div class="outline-text-3" id="text-14-7">
</div><div id="outline-container-sec-14-7-1" class="outline-4">
<h4 id="sec-14-7-1"><span class="section-number-4">14.7.1</span> Rule-based methods for uncertain reasoning &#x2026; 547</h4>
</div>
<div id="outline-container-sec-14-7-2" class="outline-4">
<h4 id="sec-14-7-2"><span class="section-number-4">14.7.2</span> Representing ignorance: Dempster&#x2013;Shafer theory &#x2026; 549</h4>
</div>
<div id="outline-container-sec-14-7-3" class="outline-4">
<h4 id="sec-14-7-3"><span class="section-number-4">14.7.3</span> Representing vagueness: Fuzzy sets and fuzzy logic &#x2026; 550</h4>
</div>
</div>
<div id="outline-container-sec-14-8" class="outline-3">
<h3 id="sec-14-8"><span class="section-number-3">14.8</span> Summary &#x2026; 551</h3>
</div>
<div id="outline-container-sec-14-9" class="outline-3">
<h3 id="sec-14-9"><span class="section-number-3">14.9</span> Bibliographical and Historical Notes &#x2026; 552</h3>
</div>
<div id="outline-container-sec-14-10" class="outline-3">
<h3 id="sec-14-10"><span class="section-number-3">14.10</span> Exercises &#x2026; 558</h3>
</div>
</div>
<div id="outline-container-sec-15" class="outline-2">
<h2 id="sec-15"><span class="section-number-2">15</span> Probabilistic Reasoning over Time &#x2026; 566</h2>
<div class="outline-text-2" id="text-15">
</div><div id="outline-container-sec-15-1" class="outline-3">
<h3 id="sec-15-1"><span class="section-number-3">15.1</span> Time and Uncertainty &#x2026; 566</h3>
<div class="outline-text-3" id="text-15-1">
</div><div id="outline-container-sec-15-1-1" class="outline-4">
<h4 id="sec-15-1-1"><span class="section-number-4">15.1.1</span> States and observations &#x2026; 567</h4>
</div>
<div id="outline-container-sec-15-1-2" class="outline-4">
<h4 id="sec-15-1-2"><span class="section-number-4">15.1.2</span> Transition and sensor models &#x2026; 568</h4>
</div>
</div>
<div id="outline-container-sec-15-2" class="outline-3">
<h3 id="sec-15-2"><span class="section-number-3">15.2</span> Inference in Temporal Models &#x2026; 570</h3>
<div class="outline-text-3" id="text-15-2">
</div><div id="outline-container-sec-15-2-1" class="outline-4">
<h4 id="sec-15-2-1"><span class="section-number-4">15.2.1</span> Filtering and prediction &#x2026; 571</h4>
</div>
<div id="outline-container-sec-15-2-2" class="outline-4">
<h4 id="sec-15-2-2"><span class="section-number-4">15.2.2</span> Smoothing &#x2026; 574</h4>
</div>
<div id="outline-container-sec-15-2-3" class="outline-4">
<h4 id="sec-15-2-3"><span class="section-number-4">15.2.3</span> Finding the most likely sequence &#x2026; 576</h4>
</div>
</div>
<div id="outline-container-sec-15-3" class="outline-3">
<h3 id="sec-15-3"><span class="section-number-3">15.3</span> Hidden Markov Models &#x2026; 578</h3>
<div class="outline-text-3" id="text-15-3">
</div><div id="outline-container-sec-15-3-1" class="outline-4">
<h4 id="sec-15-3-1"><span class="section-number-4">15.3.1</span> Simplified matrix algorithms &#x2026; 579</h4>
</div>
<div id="outline-container-sec-15-3-2" class="outline-4">
<h4 id="sec-15-3-2"><span class="section-number-4">15.3.2</span> Hidden Markov model example: Localization &#x2026; 581</h4>
</div>
</div>
<div id="outline-container-sec-15-4" class="outline-3">
<h3 id="sec-15-4"><span class="section-number-3">15.4</span> Kalman Filters &#x2026; 584</h3>
<div class="outline-text-3" id="text-15-4">
</div><div id="outline-container-sec-15-4-1" class="outline-4">
<h4 id="sec-15-4-1"><span class="section-number-4">15.4.1</span> Updating Gaussian distributions &#x2026; 584</h4>
</div>
<div id="outline-container-sec-15-4-2" class="outline-4">
<h4 id="sec-15-4-2"><span class="section-number-4">15.4.2</span> A simple one-dimensional example &#x2026; 585</h4>
</div>
<div id="outline-container-sec-15-4-3" class="outline-4">
<h4 id="sec-15-4-3"><span class="section-number-4">15.4.3</span> The general case &#x2026; 587</h4>
</div>
