doc/org/artificial-intelligence-a-modern-approach.org
*** Applicability of Kalman filtering ... 588 
** Dynamic Bayesian Networks ... 590 
*** Constructing DBNs ... 591 
*** Exact inference in DBNs ... 595 
*** Approximate inference in DBNs ... 596 
** Keeping Track of Many Objects ... 599 
** Summary ... 603 
** Bibliographical and Historical Notes ... 603 
** Exercises ... 606
* Making Simple Decisions ... 610


** Combining Beliefs and Desires under Uncertainty ... 610 
** The Basis of Utility Theory ... 611 
*** Constraints on rational preferences ... 612 
*** Preferences lead to utility ... 613 
** Utility Functions ... 615 
*** Utility assessment and utility scales ... 615 
*** The utility of money ... 616 
*** Expected utility and post-decision disappointment ... 618 
*** Human judgment and irrationality ... 619 
** Multiattribute Utility Functions ... 622 
*** Dominance ... 622 
*** Preference structure and multiattribute utility ... 624 
             Preferences without uncertainty ... 624 
             Preferences with uncertainty ... 625 
** Decision Networks ... 626 
*** Representing a decision problem with a decision network ... 626 
*** Evaluating decision networks ... 628 
** The Value of Information ... 628 
*** A simple example ... 629 
*** A general formula for perfect information ... 630 
*** Properties of the value of information ... 631 
*** Implementation of an information-gathering agent ... 632 
** Decision-Theoretic Expert Systems ... 633 
** Summary ... 636 
** Bibliographical and Historical Notes ... 636 
** Exercises ... 640
* Making Complex Decisions ... 645


** Sequential Decision Problems ... 645 
*** Utilities over time ... 648 
*** Optimal policies and the utilities of states ... 650 
** Value Iteration ... 652 
*** The Bellman equation for utilities ... 652 
*** The value iteration algorithm ... 652 
*** Convergence of value iteration ... 654 
** Policy Iteration ... 656 
** Partially Observable MDPs ... 658 
*** Definition of POMDPs ... 658 
*** Value iteration for POMDPs ... 660 
*** Online agents for POMDPs ... 664 
** Decisions with Multiple Agents: Game Theory ... 666 
*** Single-move games ... 667 
*** Repeated games ... 673 
*** Sequential games ... 674 
** Mechanism Design ... 679 
*** Auctions ... 679 
*** Common goods ... 683 
** Summary ... 684 
** Bibliographical and Historical Notes ... 685 
** Exercises ... 688

* Learning from Examples ... 693


** Forms of Learning ... 693 
             Components to be learned ... 694 
             Representation and prior knowledge ... 694 
             Feedback to learn from ... 694 
** Supervised Learning ... 695 
** Learning Decision Trees ... 697 
*** The decision tree representation ... 698 
*** Expressiveness of decision trees ... 698 
*** Inducing decision trees from examples ... 699 
*** Choosing attribute tests ... 703 
*** Generalization and overfitting ... 705 
*** Broadening the applicability of decision trees ... 706 
** Evaluating and Choosing the Best Hypothesis ... 708 
