doc/artificial-intelligence-a-modern-approach.html
<div id="outline-container-sec-15-4-4" class="outline-4">
<h4 id="sec-15-4-4"><span class="section-number-4">15.4.4</span> Applicability of Kalman filtering &#x2026; 588</h4>
</div>
</div>
<div id="outline-container-sec-15-5" class="outline-3">
<h3 id="sec-15-5"><span class="section-number-3">15.5</span> Dynamic Bayesian Networks &#x2026; 590</h3>
<div class="outline-text-3" id="text-15-5">
</div><div id="outline-container-sec-15-5-1" class="outline-4">
<h4 id="sec-15-5-1"><span class="section-number-4">15.5.1</span> Constructing DBNs &#x2026; 591</h4>
</div>
<div id="outline-container-sec-15-5-2" class="outline-4">
<h4 id="sec-15-5-2"><span class="section-number-4">15.5.2</span> Exact inference in DBNs &#x2026; 595</h4>
</div>
<div id="outline-container-sec-15-5-3" class="outline-4">
<h4 id="sec-15-5-3"><span class="section-number-4">15.5.3</span> Approximate inference in DBNs &#x2026; 596</h4>
</div>
</div>
<div id="outline-container-sec-15-6" class="outline-3">
<h3 id="sec-15-6"><span class="section-number-3">15.6</span> Keeping Track of Many Objects &#x2026; 599</h3>
</div>
<div id="outline-container-sec-15-7" class="outline-3">
<h3 id="sec-15-7"><span class="section-number-3">15.7</span> Summary &#x2026; 603</h3>
</div>
<div id="outline-container-sec-15-8" class="outline-3">
<h3 id="sec-15-8"><span class="section-number-3">15.8</span> Bibliographical and Historical Notes &#x2026; 603</h3>
</div>
<div id="outline-container-sec-15-9" class="outline-3">
<h3 id="sec-15-9"><span class="section-number-3">15.9</span> Exercises &#x2026; 606</h3>
</div>
</div>
<div id="outline-container-sec-16" class="outline-2">
<h2 id="sec-16"><span class="section-number-2">16</span> Making Simple Decisions &#x2026; 610</h2>
<div class="outline-text-2" id="text-16">
</div><div id="outline-container-sec-16-1" class="outline-3">
<h3 id="sec-16-1"><span class="section-number-3">16.1</span> Combining Beliefs and Desires under Uncertainty &#x2026; 610</h3>
</div>
<div id="outline-container-sec-16-2" class="outline-3">
<h3 id="sec-16-2"><span class="section-number-3">16.2</span> The Basis of Utility Theory &#x2026; 611</h3>
<div class="outline-text-3" id="text-16-2">
</div><div id="outline-container-sec-16-2-1" class="outline-4">
<h4 id="sec-16-2-1"><span class="section-number-4">16.2.1</span> Constraints on rational preferences &#x2026; 612</h4>
</div>
<div id="outline-container-sec-16-2-2" class="outline-4">
<h4 id="sec-16-2-2"><span class="section-number-4">16.2.2</span> Preferences lead to utility &#x2026; 613</h4>
</div>
</div>
<div id="outline-container-sec-16-3" class="outline-3">
<h3 id="sec-16-3"><span class="section-number-3">16.3</span> Utility Functions &#x2026; 615</h3>
<div class="outline-text-3" id="text-16-3">
</div><div id="outline-container-sec-16-3-1" class="outline-4">
<h4 id="sec-16-3-1"><span class="section-number-4">16.3.1</span> Utility assessment and utility scales &#x2026; 615</h4>
</div>
<div id="outline-container-sec-16-3-2" class="outline-4">
<h4 id="sec-16-3-2"><span class="section-number-4">16.3.2</span> The utility of money &#x2026; 616</h4>
</div>
<div id="outline-container-sec-16-3-3" class="outline-4">
<h4 id="sec-16-3-3"><span class="section-number-4">16.3.3</span> Expected utility and post-decision disappointment &#x2026; 618</h4>
</div>
<div id="outline-container-sec-16-3-4" class="outline-4">
<h4 id="sec-16-3-4"><span class="section-number-4">16.3.4</span> Human judgment and irrationality &#x2026; 619</h4>
</div>
</div>
<div id="outline-container-sec-16-4" class="outline-3">
<h3 id="sec-16-4"><span class="section-number-3">16.4</span> Multiattribute Utility Functions &#x2026; 622</h3>
<div class="outline-text-3" id="text-16-4">
</div><div id="outline-container-sec-16-4-1" class="outline-4">
<h4 id="sec-16-4-1"><span class="section-number-4">16.4.1</span> Dominance &#x2026; 622</h4>
</div>
<div id="outline-container-sec-16-4-2" class="outline-4">
<h4 id="sec-16-4-2"><span class="section-number-4">16.4.2</span> Preference structure and multiattribute utility &#x2026; 624</h4>
<div class="outline-text-4" id="text-16-4-2">
<p>
Preferences without uncertainty &#x2026; 624 
Preferences with uncertainty &#x2026; 625 
</p>
</div>
</div>
</div>
<div id="outline-container-sec-16-5" class="outline-3">
<h3 id="sec-16-5"><span class="section-number-3">16.5</span> Decision Networks &#x2026; 626</h3>
<div class="outline-text-3" id="text-16-5">
</div><div id="outline-container-sec-16-5-1" class="outline-4">
<h4 id="sec-16-5-1"><span class="section-number-4">16.5.1</span> Representing a decision problem with a decision network &#x2026; 626</h4>
</div>
<div id="outline-container-sec-16-5-2" class="outline-4">
<h4 id="sec-16-5-2"><span class="section-number-4">16.5.2</span> Evaluating decision networks &#x2026; 628</h4>
</div>
</div>
<div id="outline-container-sec-16-6" class="outline-3">
<h3 id="sec-16-6"><span class="section-number-3">16.6</span> The Value of Information &#x2026; 628</h3>
<div class="outline-text-3" id="text-16-6">
</div><div id="outline-container-sec-16-6-1" class="outline-4">
<h4 id="sec-16-6-1"><span class="section-number-4">16.6.1</span> A simple example &#x2026; 629</h4>
</div>
<div id="outline-container-sec-16-6-2" class="outline-4">
<h4 id="sec-16-6-2"><span class="section-number-4">16.6.2</span> A general formula for perfect information &#x2026; 630</h4>
</div>
<div id="outline-container-sec-16-6-3" class="outline-4">
<h4 id="sec-16-6-3"><span class="section-number-4">16.6.3</span> Properties of the value of information &#x2026; 631</h4>
</div>
<div id="outline-container-sec-16-6-4" class="outline-4">
<h4 id="sec-16-6-4"><span class="section-number-4">16.6.4</span> Implementation of an information-gathering agent &#x2026; 632</h4>
</div>
</div>
<div id="outline-container-sec-16-7" class="outline-3">
<h3 id="sec-16-7"><span class="section-number-3">16.7</span> Decision-Theoretic Expert Systems &#x2026; 633</h3>
</div>
<div id="outline-container-sec-16-8" class="outline-3">
<h3 id="sec-16-8"><span class="section-number-3">16.8</span> Summary &#x2026; 636</h3>
</div>
<div id="outline-container-sec-16-9" class="outline-3">
<h3 id="sec-16-9"><span class="section-number-3">16.9</span> Bibliographical and Historical Notes &#x2026; 636</h3>
</div>
<div id="outline-container-sec-16-10" class="outline-3">
<h3 id="sec-16-10"><span class="section-number-3">16.10</span> Exercises &#x2026; 640</h3>
</div>
</div>
<div id="outline-container-sec-17" class="outline-2">
<h2 id="sec-17"><span class="section-number-2">17</span> Making Complex Decisions &#x2026; 645</h2>
<div class="outline-text-2" id="text-17">
</div><div id="outline-container-sec-17-1" class="outline-3">
<h3 id="sec-17-1"><span class="section-number-3">17.1</span> Sequential Decision Problems &#x2026; 645</h3>
<div class="outline-text-3" id="text-17-1">
</div><div id="outline-container-sec-17-1-1" class="outline-4">
<h4 id="sec-17-1-1"><span class="section-number-4">17.1.1</span> Utilities over time &#x2026; 648</h4>
</div>
<div id="outline-container-sec-17-1-2" class="outline-4">
<h4 id="sec-17-1-2"><span class="section-number-4">17.1.2</span> Optimal policies and the utilities of states &#x2026; 650</h4>
</div>
</div>
<div id="outline-container-sec-17-2" class="outline-3">
<h3 id="sec-17-2"><span class="section-number-3">17.2</span> Value Iteration &#x2026; 652</h3>
<div class="outline-text-3" id="text-17-2">
</div><div id="outline-container-sec-17-2-1" class="outline-4">
<h4 id="sec-17-2-1"><span class="section-number-4">17.2.1</span> The Bellman equation for utilities &#x2026; 652</h4>
</div>
<div id="outline-container-sec-17-2-2" class="outline-4">
<h4 id="sec-17-2-2"><span class="section-number-4">17.2.2</span> The value iteration algorithm &#x2026; 652</h4>
</div>
<div id="outline-container-sec-17-2-3" class="outline-4">
<h4 id="sec-17-2-3"><span class="section-number-4">17.2.3</span> Convergence of value iteration &#x2026; 654</h4>
</div>
</div>
<div id="outline-container-sec-17-3" class="outline-3">
<h3 id="sec-17-3"><span class="section-number-3">17.3</span> Policy Iteration &#x2026; 656</h3>
</div>
<div id="outline-container-sec-17-4" class="outline-3">
<h3 id="sec-17-4"><span class="section-number-3">17.4</span> Partially Observable MDPs &#x2026; 658</h3>
<div class="outline-text-3" id="text-17-4">
</div><div id="outline-container-sec-17-4-1" class="outline-4">
<h4 id="sec-17-4-1"><span class="section-number-4">17.4.1</span> Definition of POMDPs &#x2026; 658</h4>
</div>
<div id="outline-container-sec-17-4-2" class="outline-4">
<h4 id="sec-17-4-2"><span class="section-number-4">17.4.2</span> Value iteration for POMDPs &#x2026; 660</h4>
</div>
<div id="outline-container-sec-17-4-3" class="outline-4">
<h4 id="sec-17-4-3"><span class="section-number-4">17.4.3</span> Online agents for POMDPs &#x2026; 664</h4>
</div>
</div>
<div id="outline-container-sec-17-5" class="outline-3">
<h3 id="sec-17-5"><span class="section-number-3">17.5</span> Decisions with Multiple Agents: Game Theory &#x2026; 666</h3>
<div class="outline-text-3" id="text-17-5">
</div><div id="outline-container-sec-17-5-1" class="outline-4">
<h4 id="sec-17-5-1"><span class="section-number-4">17.5.1</span> Single-move games &#x2026; 667</h4>
</div>
<div id="outline-container-sec-17-5-2" class="outline-4">
<h4 id="sec-17-5-2"><span class="section-number-4">17.5.2</span> Repeated games &#x2026; 673</h4>
</div>
<div id="outline-container-sec-17-5-3" class="outline-4">
<h4 id="sec-17-5-3"><span class="section-number-4">17.5.3</span> Sequential games &#x2026; 674</h4>
</div>
</div>
<div id="outline-container-sec-17-6" class="outline-3">
<h3 id="sec-17-6"><span class="section-number-3">17.6</span> Mechanism Design &#x2026; 679</h3>
<div class="outline-text-3" id="text-17-6">
</div><div id="outline-container-sec-17-6-1" class="outline-4">
<h4 id="sec-17-6-1"><span class="section-number-4">17.6.1</span> Auctions &#x2026; 679</h4>
</div>
<div id="outline-container-sec-17-6-2" class="outline-4">
<h4 id="sec-17-6-2"><span class="section-number-4">17.6.2</span> Common goods &#x2026; 683</h4>
</div>
</div>
<div id="outline-container-sec-17-7" class="outline-3">
<h3 id="sec-17-7"><span class="section-number-3">17.7</span> Summary &#x2026; 684</h3>
</div>
<div id="outline-container-sec-17-8" class="outline-3">
<h3 id="sec-17-8"><span class="section-number-3">17.8</span> Bibliographical and Historical Notes &#x2026; 685</h3>
</div>
<div id="outline-container-sec-17-9" class="outline-3">
<h3 id="sec-17-9"><span class="section-number-3">17.9</span> Exercises &#x2026; 688</h3>
</div>
</div>

<div id="outline-container-sec-18" class="outline-2">
<h2 id="sec-18"><span class="section-number-2">18</span> Learning from Examples &#x2026; 693</h2>
<div class="outline-text-2" id="text-18">
</div><div id="outline-container-sec-18-1" class="outline-3">
<h3 id="sec-18-1"><span class="section-number-3">18.1</span> Forms of Learning &#x2026; 693</h3>
<div class="outline-text-3" id="text-18-1">
<p>
Components to be learned &#x2026; 694 
Representation and prior knowledge &#x2026; 694 
Feedback to learn from &#x2026; 694 
</p>
</div>
</div>
<div id="outline-container-sec-18-2" class="outline-3">
<h3 id="sec-18-2"><span class="section-number-3">18.2</span> Supervised Learning &#x2026; 695</h3>
</div>
<div id="outline-container-sec-18-3" class="outline-3">
<h3 id="sec-18-3"><span class="section-number-3">18.3</span> Learning Decision Trees &#x2026; 697</h3>
<div class="outline-text-3" id="text-18-3">
</div><div id="outline-container-sec-18-3-1" class="outline-4">
<h4 id="sec-18-3-1"><span class="section-number-4">18.3.1</span> The decision tree representation &#x2026; 698</h4>
</div>
<div id="outline-container-sec-18-3-2" class="outline-4">
<h4 id="sec-18-3-2"><span class="section-number-4">18.3.2</span> Expressiveness of decision trees &#x2026; 698</h4>
</div>
<div id="outline-container-sec-18-3-3" class="outline-4">
<h4 id="sec-18-3-3"><span class="section-number-4">18.3.3</span> Inducing decision trees from examples &#x2026; 699</h4>
</div>
<div id="outline-container-sec-18-3-4" class="outline-4">
<h4 id="sec-18-3-4"><span class="section-number-4">18.3.4</span> Choosing attribute tests &#x2026; 703</h4>
</div>
<div id="outline-container-sec-18-3-5" class="outline-4">
<h4 id="sec-18-3-5"><span class="section-number-4">18.3.5</span> Generalization and overfitting &#x2026; 705</h4>
</div>
<div id="outline-container-sec-18-3-6" class="outline-4">
<h4 id="sec-18-3-6"><span class="section-number-4">18.3.6</span> Broadening the applicability of decision trees &#x2026; 706</h4>
</div>
</div>
<div id="outline-container-sec-18-4" class="outline-3">
<h3 id="sec-18-4"><span class="section-number-3">18.4</span> Evaluating and Choosing the Best Hypothesis &#x2026; 708</h3>
