doc/org/artificial-intelligence-a-modern-approach.org
*** Model selection: Complexity versus goodness of fit ... 709 
*** From error rates to loss ... 710 
*** Regularization ... 712 
** The Theory of Learning ... 713 
*** PAC learning example: Learning decision lists ... 715 
** Regression and Classification with Linear Models ... 717 
*** Univariate linear regression ... 718 
*** Multivariate linear regression ... 720 
*** Linear classifiers with a hard threshold ... 723 
*** Linear classification with logistic regression ... 725 
** Artificial Neural Networks ... 727 
*** Neural network structures ... 728 
*** Single-layer feed-forward neural networks (perceptrons) ... 729 
*** Multilayer feed-forward neural networks ... 731 
*** Learning in multilayer networks ... 733 
*** Learning neural network structures ... 736 
** Nonparametric Models ... 737 
*** Nearest neighbor models ... 738 
*** Finding nearest neighbors with k-d trees ... 739 
*** Locality-sensitive hashing ... 740 
*** Nonparametric regression ... 741 
** Support Vector Machines ... 744 
18.10. Ensemble Learning ... 748 
      18.10.1. Online Learning ... 752 
18.11. Practical Machine Learning ... 753 
      18.11.1. Case study: Handwritten digit recognition ... 753 
      18.11.2. Case study: Word senses and house prices ... 755 
18.12. Summary ... 757 
** Bibliographical and Historical Notes ... 758 
** Exercises ... 763
* Knowledge in Learning ... 768


** A Logical Formulation of Learning ... 768 
*** Examples and hypotheses ... 768 
*** Current-best-hypothesis search ... 770 
*** Least-commitment search ... 773 
** Knowledge in Learning ... 777 
*** Some simple examples ... 778 
*** Some general schemes ... 778 
** Explanation-Based Learning ... 780 
*** Extracting general rules from examples ... 781 
*** Improving efficiency ... 783 
** Learning Using Relevance Information ... 784 
*** Determining the hypothesis space ... 785 
*** Learning and using relevance information ... 785 
** Inductive Logic Programming ... 788 
*** An example ... 788 
*** Top-down inductive learning methods ... 791 
*** Inductive learning with inverse deduction ... 794 
*** Making discoveries with inductive logic programming ... 796 
** Summary ... 797 
** Bibliographical and Historical Notes ... 798 
** Exercises ... 801
* Chapter 20: Learning Probabilistic Models ... 802


** Statistical Learning ... 802 
** Learning with Complete Data ... 806 
*** Maximum-likelihood parameter learning: Discrete models ... 806 
*** Naive Bayes models ... 808 
*** Maximum-likelihood parameter learning: Continuous models ... 809 
*** Bayesian parameter learning ... 810 
*** Learning Bayes net structures ... 813 
*** Density estimation with nonparametric models ... 814 
** Learning with Hidden Variables: The EM Algorithm ... 816 
*** Unsupervised clustering: Learning mixtures of Gaussians ... 817 
*** Learning Bayesian networks with hidden variables ... 820 
*** Learning hidden Markov models ... 822 
*** The general form of the EM algorithm ... 823 
*** Learning Bayes net structures with hidden variables ... 824 
** Summary ... 825 
** Bibliographical and Historical Notes ... 825 
** Exercises ... 827
* Reinforcement Learning ... 830


