doc/artificial-intelligence-a-modern-approach.html
<div class="outline-text-3" id="text-18-4">
</div><div id="outline-container-sec-18-4-1" class="outline-4">
<h4 id="sec-18-4-1"><span class="section-number-4">18.4.1</span> Model selection: Complexity versus goodness of fit &#x2026; 709</h4>
</div>
<div id="outline-container-sec-18-4-2" class="outline-4">
<h4 id="sec-18-4-2"><span class="section-number-4">18.4.2</span> From error rates to loss &#x2026; 710</h4>
</div>
<div id="outline-container-sec-18-4-3" class="outline-4">
<h4 id="sec-18-4-3"><span class="section-number-4">18.4.3</span> Regularization &#x2026; 712</h4>
</div>
</div>
<div id="outline-container-sec-18-5" class="outline-3">
<h3 id="sec-18-5"><span class="section-number-3">18.5</span> The Theory of Learning &#x2026; 713</h3>
<div class="outline-text-3" id="text-18-5">
</div><div id="outline-container-sec-18-5-1" class="outline-4">
<h4 id="sec-18-5-1"><span class="section-number-4">18.5.1</span> PAC learning example: Learning decision lists &#x2026; 715</h4>
</div>
</div>
<div id="outline-container-sec-18-6" class="outline-3">
<h3 id="sec-18-6"><span class="section-number-3">18.6</span> Regression and Classification with Linear Models &#x2026; 717</h3>
<div class="outline-text-3" id="text-18-6">
</div><div id="outline-container-sec-18-6-1" class="outline-4">
<h4 id="sec-18-6-1"><span class="section-number-4">18.6.1</span> Univariate linear regression &#x2026; 718</h4>
</div>
<div id="outline-container-sec-18-6-2" class="outline-4">
<h4 id="sec-18-6-2"><span class="section-number-4">18.6.2</span> Multivariate linear regression &#x2026; 720</h4>
</div>
<div id="outline-container-sec-18-6-3" class="outline-4">
<h4 id="sec-18-6-3"><span class="section-number-4">18.6.3</span> Linear classifiers with a hard threshold &#x2026; 723</h4>
</div>
<div id="outline-container-sec-18-6-4" class="outline-4">
<h4 id="sec-18-6-4"><span class="section-number-4">18.6.4</span> Linear classification with logistic regression &#x2026; 725</h4>
</div>
</div>
<div id="outline-container-sec-18-7" class="outline-3">
<h3 id="sec-18-7"><span class="section-number-3">18.7</span> Artificial Neural Networks &#x2026; 727</h3>
<div class="outline-text-3" id="text-18-7">
</div><div id="outline-container-sec-18-7-1" class="outline-4">
<h4 id="sec-18-7-1"><span class="section-number-4">18.7.1</span> Neural network structures &#x2026; 728</h4>
</div>
<div id="outline-container-sec-18-7-2" class="outline-4">
<h4 id="sec-18-7-2"><span class="section-number-4">18.7.2</span> Single-layer feed-forward neural networks (perceptrons) &#x2026; 729</h4>
</div>
<div id="outline-container-sec-18-7-3" class="outline-4">
<h4 id="sec-18-7-3"><span class="section-number-4">18.7.3</span> Multilayer feed-forward neural networks &#x2026; 731</h4>
</div>
<div id="outline-container-sec-18-7-4" class="outline-4">
<h4 id="sec-18-7-4"><span class="section-number-4">18.7.4</span> Learning in multilayer networks &#x2026; 733</h4>
</div>
<div id="outline-container-sec-18-7-5" class="outline-4">
<h4 id="sec-18-7-5"><span class="section-number-4">18.7.5</span> Learning neural network structures &#x2026; 736</h4>
</div>
</div>
<div id="outline-container-sec-18-8" class="outline-3">
<h3 id="sec-18-8"><span class="section-number-3">18.8</span> Nonparametric Models &#x2026; 737</h3>
<div class="outline-text-3" id="text-18-8">
</div><div id="outline-container-sec-18-8-1" class="outline-4">
<h4 id="sec-18-8-1"><span class="section-number-4">18.8.1</span> Nearest neighbor models &#x2026; 738</h4>
</div>
<div id="outline-container-sec-18-8-2" class="outline-4">
<h4 id="sec-18-8-2"><span class="section-number-4">18.8.2</span> Finding nearest neighbors with k-d trees &#x2026; 739</h4>
</div>
<div id="outline-container-sec-18-8-3" class="outline-4">
<h4 id="sec-18-8-3"><span class="section-number-4">18.8.3</span> Locality-sensitive hashing &#x2026; 740</h4>
</div>
<div id="outline-container-sec-18-8-4" class="outline-4">
<h4 id="sec-18-8-4"><span class="section-number-4">18.8.4</span> Nonparametric regression &#x2026; 741</h4>
</div>
</div>
<div id="outline-container-sec-18-9" class="outline-3">
<h3 id="sec-18-9"><span class="section-number-3">18.9</span> Support Vector Machines &#x2026; 744</h3>
<div class="outline-text-3" id="text-18-9">
<p>
18.10. Ensemble Learning &#x2026; 748 
      18.10.1. Online Learning &#x2026; 752 
18.11. Practical Machine Learning &#x2026; 753 
      18.11.1. Case study: Handwritten digit recognition &#x2026; 753 
      18.11.2. Case study: Word senses and house prices &#x2026; 755 
18.12. Summary &#x2026; 757 
</p>
</div>
</div>
<div id="outline-container-sec-18-10" class="outline-3">
<h3 id="sec-18-10"><span class="section-number-3">18.10</span> Bibliographical and Historical Notes &#x2026; 758</h3>
</div>
<div id="outline-container-sec-18-11" class="outline-3">
<h3 id="sec-18-11"><span class="section-number-3">18.11</span> Exercises &#x2026; 763</h3>
</div>
</div>
<div id="outline-container-sec-19" class="outline-2">
<h2 id="sec-19"><span class="section-number-2">19</span> Knowledge in Learning &#x2026; 768</h2>
<div class="outline-text-2" id="text-19">
</div><div id="outline-container-sec-19-1" class="outline-3">
<h3 id="sec-19-1"><span class="section-number-3">19.1</span> A Logical Formulation of Learning &#x2026; 768</h3>
<div class="outline-text-3" id="text-19-1">
</div><div id="outline-container-sec-19-1-1" class="outline-4">
<h4 id="sec-19-1-1"><span class="section-number-4">19.1.1</span> Examples and hypotheses &#x2026; 768</h4>
</div>
<div id="outline-container-sec-19-1-2" class="outline-4">
<h4 id="sec-19-1-2"><span class="section-number-4">19.1.2</span> Current-best-hypothesis search &#x2026; 770</h4>
</div>
<div id="outline-container-sec-19-1-3" class="outline-4">
<h4 id="sec-19-1-3"><span class="section-number-4">19.1.3</span> Least-commitment search &#x2026; 773</h4>
</div>
</div>
<div id="outline-container-sec-19-2" class="outline-3">
<h3 id="sec-19-2"><span class="section-number-3">19.2</span> Knowledge in Learning &#x2026; 777</h3>
<div class="outline-text-3" id="text-19-2">
</div><div id="outline-container-sec-19-2-1" class="outline-4">
<h4 id="sec-19-2-1"><span class="section-number-4">19.2.1</span> Some simple examples &#x2026; 778</h4>
</div>
<div id="outline-container-sec-19-2-2" class="outline-4">
<h4 id="sec-19-2-2"><span class="section-number-4">19.2.2</span> Some general schemes &#x2026; 778</h4>
</div>
</div>
<div id="outline-container-sec-19-3" class="outline-3">
<h3 id="sec-19-3"><span class="section-number-3">19.3</span> Explanation-Based Learning &#x2026; 780</h3>
<div class="outline-text-3" id="text-19-3">
</div><div id="outline-container-sec-19-3-1" class="outline-4">
<h4 id="sec-19-3-1"><span class="section-number-4">19.3.1</span> Extracting general rules from examples &#x2026; 781</h4>
</div>
<div id="outline-container-sec-19-3-2" class="outline-4">
<h4 id="sec-19-3-2"><span class="section-number-4">19.3.2</span> Improving efficiency &#x2026; 783</h4>
</div>
</div>
<div id="outline-container-sec-19-4" class="outline-3">
<h3 id="sec-19-4"><span class="section-number-3">19.4</span> Learning Using Relevance Information &#x2026; 784</h3>
<div class="outline-text-3" id="text-19-4">
</div><div id="outline-container-sec-19-4-1" class="outline-4">
<h4 id="sec-19-4-1"><span class="section-number-4">19.4.1</span> Determining the hypothesis space &#x2026; 785</h4>
</div>
<div id="outline-container-sec-19-4-2" class="outline-4">
<h4 id="sec-19-4-2"><span class="section-number-4">19.4.2</span> Learning and using relevance information &#x2026; 785</h4>
</div>
</div>
<div id="outline-container-sec-19-5" class="outline-3">
<h3 id="sec-19-5"><span class="section-number-3">19.5</span> Inductive Logic Programming &#x2026; 788</h3>
<div class="outline-text-3" id="text-19-5">
</div><div id="outline-container-sec-19-5-1" class="outline-4">
<h4 id="sec-19-5-1"><span class="section-number-4">19.5.1</span> An example &#x2026; 788</h4>
</div>
<div id="outline-container-sec-19-5-2" class="outline-4">
<h4 id="sec-19-5-2"><span class="section-number-4">19.5.2</span> Top-down inductive learning methods &#x2026; 791</h4>
</div>
<div id="outline-container-sec-19-5-3" class="outline-4">
<h4 id="sec-19-5-3"><span class="section-number-4">19.5.3</span> Inductive learning with inverse deduction &#x2026; 794</h4>
</div>
<div id="outline-container-sec-19-5-4" class="outline-4">
<h4 id="sec-19-5-4"><span class="section-number-4">19.5.4</span> Making discoveries with inductive logic programming &#x2026; 796</h4>
</div>
</div>
<div id="outline-container-sec-19-6" class="outline-3">
<h3 id="sec-19-6"><span class="section-number-3">19.6</span> Summary &#x2026; 797</h3>
</div>
<div id="outline-container-sec-19-7" class="outline-3">
<h3 id="sec-19-7"><span class="section-number-3">19.7</span> Bibliographical and Historical Notes &#x2026; 798</h3>
</div>
<div id="outline-container-sec-19-8" class="outline-3">
<h3 id="sec-19-8"><span class="section-number-3">19.8</span> Exercises &#x2026; 801</h3>
</div>
</div>
<div id="outline-container-sec-20" class="outline-2">
<h2 id="sec-20"><span class="section-number-2">20</span> Chapter 20: Learning Probabilistic Models &#x2026; 802</h2>
<div class="outline-text-2" id="text-20">
</div><div id="outline-container-sec-20-1" class="outline-3">
<h3 id="sec-20-1"><span class="section-number-3">20.1</span> Statistical Learning &#x2026; 802</h3>
</div>
<div id="outline-container-sec-20-2" class="outline-3">
<h3 id="sec-20-2"><span class="section-number-3">20.2</span> Learning with Complete Data &#x2026; 806</h3>
<div class="outline-text-3" id="text-20-2">
</div><div id="outline-container-sec-20-2-1" class="outline-4">
<h4 id="sec-20-2-1"><span class="section-number-4">20.2.1</span> Maximum-likelihood parameter learning: Discrete models &#x2026; 806</h4>
</div>
<div id="outline-container-sec-20-2-2" class="outline-4">
<h4 id="sec-20-2-2"><span class="section-number-4">20.2.2</span> Naive Bayes models &#x2026; 808</h4>
</div>
<div id="outline-container-sec-20-2-3" class="outline-4">
<h4 id="sec-20-2-3"><span class="section-number-4">20.2.3</span> Maximum-likelihood parameter learning: Continuous models &#x2026; 809</h4>
</div>
<div id="outline-container-sec-20-2-4" class="outline-4">
<h4 id="sec-20-2-4"><span class="section-number-4">20.2.4</span> Bayesian parameter learning &#x2026; 810</h4>
</div>
<div id="outline-container-sec-20-2-5" class="outline-4">
<h4 id="sec-20-2-5"><span class="section-number-4">20.2.5</span> Learning Bayes net structures &#x2026; 813</h4>
</div>
<div id="outline-container-sec-20-2-6" class="outline-4">
<h4 id="sec-20-2-6"><span class="section-number-4">20.2.6</span> Density estimation with nonparametric models &#x2026; 814</h4>
</div>
</div>
<div id="outline-container-sec-20-3" class="outline-3">
<h3 id="sec-20-3"><span class="section-number-3">20.3</span> Learning with Hidden Variables: The EM Algorithm &#x2026; 816</h3>
<div class="outline-text-3" id="text-20-3">
</div><div id="outline-container-sec-20-3-1" class="outline-4">
<h4 id="sec-20-3-1"><span class="section-number-4">20.3.1</span> Unsupervised clustering: Learning mixtures of Gaussians &#x2026; 817</h4>
</div>
<div id="outline-container-sec-20-3-2" class="outline-4">
<h4 id="sec-20-3-2"><span class="section-number-4">20.3.2</span> Learning Bayesian networks with hidden variables &#x2026; 820</h4>
</div>
<div id="outline-container-sec-20-3-3" class="outline-4">
<h4 id="sec-20-3-3"><span class="section-number-4">20.3.3</span> Learning hidden Markov models &#x2026; 822</h4>
</div>
<div id="outline-container-sec-20-3-4" class="outline-4">
<h4 id="sec-20-3-4"><span class="section-number-4">20.3.4</span> The general form of the EM algorithm &#x2026; 823</h4>
</div>
<div id="outline-container-sec-20-3-5" class="outline-4">
<h4 id="sec-20-3-5"><span class="section-number-4">20.3.5</span> Learning Bayes net structures with hidden variables &#x2026; 824</h4>
</div>
</div>
<div id="outline-container-sec-20-4" class="outline-3">
<h3 id="sec-20-4"><span class="section-number-3">20.4</span> Summary &#x2026; 825</h3>
</div>
<div id="outline-container-sec-20-5" class="outline-3">
<h3 id="sec-20-5"><span class="section-number-3">20.5</span> Bibliographical and Historical Notes &#x2026; 825</h3>
</div>
<div id="outline-container-sec-20-6" class="outline-3">
<h3 id="sec-20-6"><span class="section-number-3">20.6</span> Exercises &#x2026; 827</h3>
</div>
</div>
<div id="outline-container-sec-21" class="outline-2">
<h2 id="sec-21"><span class="section-number-2">21</span> Reinforcement Learning &#x2026; 830</h2>
