doc/org/artificial-intelligence-a-modern-approach.org
** Introduction ... 830 
** Passive Reinforcement Learning ... 832 
*** Direct utility estimation ... 833 
*** Adaptive dynamic programming ... 834 
*** Temporal-difference learning ... 836 
** Active Reinforcement Learning ... 839 
*** Exploration ... 839 
*** Learning an action-utility function ... 842 
** Generalization in Reinforcement Learning ... 845 
** Policy Search ... 848 
** Applications of Reinforcement Learning ... 850 
*** Applications to game playing ... 850 
*** Application to robot control ... 851 
** Summary ... 853 
** Bibliographical and Historical Notes ... 854 
** Exercises ... 858

* Natural Language Processing ... 860


** Language Models ... 860 
      22.1.1 N-gram character models ... 861 
*** Smoothing n-gram models ... 862 
*** Model evaluation ... 863 
      22.1.4 N-gram word models ... 864 
** Text Classification ... 865 
*** Classification by data compression ... 866 
** Information Retrieval ... 867 
*** IR scoring functions ... 868 
*** IR system evaluation ... 869 
*** IR refinements ... 869 
*** The PageRank algorithm ... 870 
*** The HITS algorithm ... 872 
*** Question answering ... 872 
** Information Extraction ... 873 
*** Finite-state automata for information extraction ... 874 
*** Probabilistic models for information extraction ... 876 
*** Conditional random fields for information extraction ... 878 
*** Ontology extraction from large corpora ... 879 
*** Automated template construction ... 880 
*** Machine reading ... 881 
** Summary ... 882 
** Bibliographical and Historical Notes ... 883 
** Exercises ... 885
* Natural Language for Communication ... 888


** Phrase Structure Grammars ... 888 
*** The lexicon of E0 ... 890 
*** The Grammar of E0 ... 890 
** Syntactic Analysis (Parsing) ... 892 
*** Learning probabilities for PCFGs ... 895 
*** Comparing context-free and Markov models ... 896 
** Augmented Grammars and Semantic Interpretation ... 897 
*** Lexicalized PCFGs ... 897 
*** Formal definition of augmented grammar rules ... 898 
*** Case agreement and subject--verb agreement ... 899 
*** Semantic interpretation ... 900 
*** Complications ... 902 
** Machine Translation ... 907 
*** Machine translation systems ... 908 
*** Statistical machine translation ... 909 
** Speech Recognition ... 912 
*** Acoustic model ... 914 
*** Language model ... 917 
*** Building a speech recognizer ... 917 
** Summary ... 918 
** Bibliographical and Historical Notes ... 919 
** Exercises ... 923
* Perception ... 928


** Image Formation ... 929 
*** Images without lenses: The pinhole camera ... 929 
*** Lens systems ... 931 
*** Scaled orthographic projection ... 932 
*** Light and shading ... 932 
*** Color ... 935 
** Early Image-Processing Operations ... 935 
*** Edge detection ... 936 
*** Texture ... 939 
