doc/artificial-intelligence-a-modern-approach.html
<div class="outline-text-2" id="text-21">
</div><div id="outline-container-sec-21-1" class="outline-3">
<h3 id="sec-21-1"><span class="section-number-3">21.1</span> Introduction &#x2026; 830</h3>
</div>
<div id="outline-container-sec-21-2" class="outline-3">
<h3 id="sec-21-2"><span class="section-number-3">21.2</span> Passive Reinforcement Learning &#x2026; 832</h3>
<div class="outline-text-3" id="text-21-2">
</div><div id="outline-container-sec-21-2-1" class="outline-4">
<h4 id="sec-21-2-1"><span class="section-number-4">21.2.1</span> Direct utility estimation &#x2026; 833</h4>
</div>
<div id="outline-container-sec-21-2-2" class="outline-4">
<h4 id="sec-21-2-2"><span class="section-number-4">21.2.2</span> Adaptive dynamic programming &#x2026; 834</h4>
</div>
<div id="outline-container-sec-21-2-3" class="outline-4">
<h4 id="sec-21-2-3"><span class="section-number-4">21.2.3</span> Temporal-difference learning &#x2026; 836</h4>
</div>
</div>
<div id="outline-container-sec-21-3" class="outline-3">
<h3 id="sec-21-3"><span class="section-number-3">21.3</span> Active Reinforcement Learning &#x2026; 839</h3>
<div class="outline-text-3" id="text-21-3">
</div><div id="outline-container-sec-21-3-1" class="outline-4">
<h4 id="sec-21-3-1"><span class="section-number-4">21.3.1</span> Exploration &#x2026; 839</h4>
</div>
<div id="outline-container-sec-21-3-2" class="outline-4">
<h4 id="sec-21-3-2"><span class="section-number-4">21.3.2</span> Learning an action-utility function &#x2026; 842</h4>
</div>
</div>
<div id="outline-container-sec-21-4" class="outline-3">
<h3 id="sec-21-4"><span class="section-number-3">21.4</span> Generalization in Reinforcement Learning &#x2026; 845</h3>
</div>
<div id="outline-container-sec-21-5" class="outline-3">
<h3 id="sec-21-5"><span class="section-number-3">21.5</span> Policy Search &#x2026; 848</h3>
</div>
<div id="outline-container-sec-21-6" class="outline-3">
<h3 id="sec-21-6"><span class="section-number-3">21.6</span> Applications of Reinforcement Learning &#x2026; 850</h3>
<div class="outline-text-3" id="text-21-6">
</div><div id="outline-container-sec-21-6-1" class="outline-4">
<h4 id="sec-21-6-1"><span class="section-number-4">21.6.1</span> Applications to game playing &#x2026; 850</h4>
</div>
<div id="outline-container-sec-21-6-2" class="outline-4">
<h4 id="sec-21-6-2"><span class="section-number-4">21.6.2</span> Application to robot control &#x2026; 851</h4>
</div>
</div>
<div id="outline-container-sec-21-7" class="outline-3">
<h3 id="sec-21-7"><span class="section-number-3">21.7</span> Summary &#x2026; 853</h3>
</div>
<div id="outline-container-sec-21-8" class="outline-3">
<h3 id="sec-21-8"><span class="section-number-3">21.8</span> Bibliographical and Historical Notes &#x2026; 854</h3>
</div>
<div id="outline-container-sec-21-9" class="outline-3">
<h3 id="sec-21-9"><span class="section-number-3">21.9</span> Exercises &#x2026; 858</h3>
</div>
</div>

<div id="outline-container-sec-22" class="outline-2">
<h2 id="sec-22"><span class="section-number-2">22</span> Natural Language Processing &#x2026; 860</h2>
<div class="outline-text-2" id="text-22">
</div><div id="outline-container-sec-22-1" class="outline-3">
<h3 id="sec-22-1"><span class="section-number-3">22.1</span> Language Models &#x2026; 860</h3>
<div class="outline-text-3" id="text-22-1">
<p>
22.1.1 N-gram character models &#x2026; 861 
</p>
</div>
<div id="outline-container-sec-22-1-1" class="outline-4">
<h4 id="sec-22-1-1"><span class="section-number-4">22.1.1</span> Smoothing n-gram models &#x2026; 862</h4>
</div>
<div id="outline-container-sec-22-1-2" class="outline-4">
<h4 id="sec-22-1-2"><span class="section-number-4">22.1.2</span> Model evaluation &#x2026; 863</h4>
<div class="outline-text-4" id="text-22-1-2">
<p>
22.1.4 N-gram word models &#x2026; 864 
</p>
</div>
</div>
</div>
<div id="outline-container-sec-22-2" class="outline-3">
<h3 id="sec-22-2"><span class="section-number-3">22.2</span> Text Classification &#x2026; 865</h3>
<div class="outline-text-3" id="text-22-2">
</div><div id="outline-container-sec-22-2-1" class="outline-4">
<h4 id="sec-22-2-1"><span class="section-number-4">22.2.1</span> Classification by data compression &#x2026; 866</h4>
</div>
</div>
<div id="outline-container-sec-22-3" class="outline-3">
<h3 id="sec-22-3"><span class="section-number-3">22.3</span> Information Retrieval &#x2026; 867</h3>
<div class="outline-text-3" id="text-22-3">
</div><div id="outline-container-sec-22-3-1" class="outline-4">
<h4 id="sec-22-3-1"><span class="section-number-4">22.3.1</span> IR scoring functions &#x2026; 868</h4>
</div>
<div id="outline-container-sec-22-3-2" class="outline-4">
<h4 id="sec-22-3-2"><span class="section-number-4">22.3.2</span> IR system evaluation &#x2026; 869</h4>
</div>
<div id="outline-container-sec-22-3-3" class="outline-4">
<h4 id="sec-22-3-3"><span class="section-number-4">22.3.3</span> IR refinements &#x2026; 869</h4>
</div>
<div id="outline-container-sec-22-3-4" class="outline-4">
<h4 id="sec-22-3-4"><span class="section-number-4">22.3.4</span> The PageRank algorithm &#x2026; 870</h4>
</div>
<div id="outline-container-sec-22-3-5" class="outline-4">
<h4 id="sec-22-3-5"><span class="section-number-4">22.3.5</span> The HITS algorithm &#x2026; 872</h4>
</div>
<div id="outline-container-sec-22-3-6" class="outline-4">
<h4 id="sec-22-3-6"><span class="section-number-4">22.3.6</span> Question answering &#x2026; 872</h4>
</div>
</div>
<div id="outline-container-sec-22-4" class="outline-3">
<h3 id="sec-22-4"><span class="section-number-3">22.4</span> Information Extraction &#x2026; 873</h3>
<div class="outline-text-3" id="text-22-4">
</div><div id="outline-container-sec-22-4-1" class="outline-4">
<h4 id="sec-22-4-1"><span class="section-number-4">22.4.1</span> Finite-state automata for information extraction &#x2026; 874</h4>
</div>
<div id="outline-container-sec-22-4-2" class="outline-4">
<h4 id="sec-22-4-2"><span class="section-number-4">22.4.2</span> Probabilistic models for information extraction &#x2026; 876</h4>
</div>
<div id="outline-container-sec-22-4-3" class="outline-4">
<h4 id="sec-22-4-3"><span class="section-number-4">22.4.3</span> Conditional random fields for information extraction &#x2026; 878</h4>
</div>
<div id="outline-container-sec-22-4-4" class="outline-4">
<h4 id="sec-22-4-4"><span class="section-number-4">22.4.4</span> Ontology extraction from large corpora &#x2026; 879</h4>
</div>
<div id="outline-container-sec-22-4-5" class="outline-4">
<h4 id="sec-22-4-5"><span class="section-number-4">22.4.5</span> Automated template construction &#x2026; 880</h4>
</div>
<div id="outline-container-sec-22-4-6" class="outline-4">
<h4 id="sec-22-4-6"><span class="section-number-4">22.4.6</span> Machine reading &#x2026; 881</h4>
</div>
</div>
<div id="outline-container-sec-22-5" class="outline-3">
<h3 id="sec-22-5"><span class="section-number-3">22.5</span> Summary &#x2026; 882</h3>
</div>
<div id="outline-container-sec-22-6" class="outline-3">
<h3 id="sec-22-6"><span class="section-number-3">22.6</span> Bibliographical and Historical Notes &#x2026; 883</h3>
</div>
<div id="outline-container-sec-22-7" class="outline-3">
<h3 id="sec-22-7"><span class="section-number-3">22.7</span> Exercises &#x2026; 885</h3>
</div>
</div>
<div id="outline-container-sec-23" class="outline-2">
<h2 id="sec-23"><span class="section-number-2">23</span> Natural Language for Communication &#x2026; 888</h2>
<div class="outline-text-2" id="text-23">
</div><div id="outline-container-sec-23-1" class="outline-3">
<h3 id="sec-23-1"><span class="section-number-3">23.1</span> Phrase Structure Grammars &#x2026; 888</h3>
<div class="outline-text-3" id="text-23-1">
</div><div id="outline-container-sec-23-1-1" class="outline-4">
<h4 id="sec-23-1-1"><span class="section-number-4">23.1.1</span> The lexicon of E0 &#x2026; 890</h4>
</div>
<div id="outline-container-sec-23-1-2" class="outline-4">
<h4 id="sec-23-1-2"><span class="section-number-4">23.1.2</span> The Grammar of E0 &#x2026; 890</h4>
</div>
</div>
<div id="outline-container-sec-23-2" class="outline-3">
<h3 id="sec-23-2"><span class="section-number-3">23.2</span> Syntactic Analysis (Parsing) &#x2026; 892</h3>
<div class="outline-text-3" id="text-23-2">
</div><div id="outline-container-sec-23-2-1" class="outline-4">
<h4 id="sec-23-2-1"><span class="section-number-4">23.2.1</span> Learning probabilities for PCFGs &#x2026; 895</h4>
</div>
<div id="outline-container-sec-23-2-2" class="outline-4">
<h4 id="sec-23-2-2"><span class="section-number-4">23.2.2</span> Comparing context-free and Markov models &#x2026; 896</h4>
</div>
</div>
<div id="outline-container-sec-23-3" class="outline-3">
<h3 id="sec-23-3"><span class="section-number-3">23.3</span> Augmented Grammars and Semantic Interpretation &#x2026; 897</h3>
<div class="outline-text-3" id="text-23-3">
</div><div id="outline-container-sec-23-3-1" class="outline-4">
<h4 id="sec-23-3-1"><span class="section-number-4">23.3.1</span> Lexicalized PCFGs &#x2026; 897</h4>
</div>
<div id="outline-container-sec-23-3-2" class="outline-4">
<h4 id="sec-23-3-2"><span class="section-number-4">23.3.2</span> Formal definition of augmented grammar rules &#x2026; 898</h4>
</div>
<div id="outline-container-sec-23-3-3" class="outline-4">
<h4 id="sec-23-3-3"><span class="section-number-4">23.3.3</span> Case agreement and subject&#x2013;verb agreement &#x2026; 899</h4>
</div>
<div id="outline-container-sec-23-3-4" class="outline-4">
<h4 id="sec-23-3-4"><span class="section-number-4">23.3.4</span> Semantic interpretation &#x2026; 900</h4>
</div>
<div id="outline-container-sec-23-3-5" class="outline-4">
<h4 id="sec-23-3-5"><span class="section-number-4">23.3.5</span> Complications &#x2026; 902</h4>
</div>
</div>
<div id="outline-container-sec-23-4" class="outline-3">
<h3 id="sec-23-4"><span class="section-number-3">23.4</span> Machine Translation &#x2026; 907</h3>
<div class="outline-text-3" id="text-23-4">
</div><div id="outline-container-sec-23-4-1" class="outline-4">
<h4 id="sec-23-4-1"><span class="section-number-4">23.4.1</span> Machine translation systems &#x2026; 908</h4>
</div>
<div id="outline-container-sec-23-4-2" class="outline-4">
<h4 id="sec-23-4-2"><span class="section-number-4">23.4.2</span> Statistical machine translation &#x2026; 909</h4>
</div>
</div>
<div id="outline-container-sec-23-5" class="outline-3">
<h3 id="sec-23-5"><span class="section-number-3">23.5</span> Speech Recognition &#x2026; 912</h3>
<div class="outline-text-3" id="text-23-5">
</div><div id="outline-container-sec-23-5-1" class="outline-4">
<h4 id="sec-23-5-1"><span class="section-number-4">23.5.1</span> Acoustic model &#x2026; 914</h4>
</div>
<div id="outline-container-sec-23-5-2" class="outline-4">
<h4 id="sec-23-5-2"><span class="section-number-4">23.5.2</span> Language model &#x2026; 917</h4>
</div>
<div id="outline-container-sec-23-5-3" class="outline-4">
<h4 id="sec-23-5-3"><span class="section-number-4">23.5.3</span> Building a speech recognizer &#x2026; 917</h4>
</div>
</div>
<div id="outline-container-sec-23-6" class="outline-3">
<h3 id="sec-23-6"><span class="section-number-3">23.6</span> Summary &#x2026; 918</h3>
</div>
<div id="outline-container-sec-23-7" class="outline-3">
<h3 id="sec-23-7"><span class="section-number-3">23.7</span> Bibliographical and Historical Notes &#x2026; 919</h3>
</div>
<div id="outline-container-sec-23-8" class="outline-3">
<h3 id="sec-23-8"><span class="section-number-3">23.8</span> Exercises &#x2026; 923</h3>
</div>
</div>
<div id="outline-container-sec-24" class="outline-2">
<h2 id="sec-24"><span class="section-number-2">24</span> Perception &#x2026; 928</h2>
<div class="outline-text-2" id="text-24">
</div><div id="outline-container-sec-24-1" class="outline-3">
<h3 id="sec-24-1"><span class="section-number-3">24.1</span> Image Formation &#x2026; 929</h3>
<div class="outline-text-3" id="text-24-1">
</div><div id="outline-container-sec-24-1-1" class="outline-4">
<h4 id="sec-24-1-1"><span class="section-number-4">24.1.1</span> Images without lenses: The pinhole camera &#x2026; 929</h4>
</div>
<div id="outline-container-sec-24-1-2" class="outline-4">
<h4 id="sec-24-1-2"><span class="section-number-4">24.1.2</span> Lens systems &#x2026; 931</h4>
</div>
<div id="outline-container-sec-24-1-3" class="outline-4">
<h4 id="sec-24-1-3"><span class="section-number-4">24.1.3</span> Scaled orthographic projection &#x2026; 932</h4>
</div>
<div id="outline-container-sec-24-1-4" class="outline-4">
<h4 id="sec-24-1-4"><span class="section-number-4">24.1.4</span> Light and shading &#x2026; 932</h4>
</div>
<div id="outline-container-sec-24-1-5" class="outline-4">
<h4 id="sec-24-1-5"><span class="section-number-4">24.1.5</span> Color &#x2026; 935</h4>
</div>
</div>
<div id="outline-container-sec-24-2" class="outline-3">
<h3 id="sec-24-2"><span class="section-number-3">24.2</span> Early Image-Processing Operations &#x2026; 935</h3>
<div class="outline-text-3" id="text-24-2">
</div><div id="outline-container-sec-24-2-1" class="outline-4">
<h4 id="sec-24-2-1"><span class="section-number-4">24.2.1</span> Edge detection &#x2026; 936</h4>
</div>
