doc/org/artificial-intelligence-a-modern-approach.org
*** Optical flow ... 939 
*** Segmentation of images ... 941 
** Object Recognition by Appearance ... 942 
*** Complex appearance and pattern elements ... 944 
*** Pedestrian detection with HOG features ... 945 
** Reconstructing the 3D World ... 947 
*** Motion parallax ... 948 
*** Binocular stereopsis ... 949 
*** Multiple views ... 951 
*** Texture ... 951 
*** Shading ... 952 
*** Contour ... 953 
*** Objects and the geometric structure of scenes ... 954 
** Object Recognition from Structural Information ... 957 
*** The geometry of bodies: Finding arms and legs ... 958 
*** Coherent appearance: Tracking people in video ... 959 
** Using Vision ... 961 
*** Words and pictures ... 962 
*** Reconstruction from many views ... 962 
*** Using vision for controlling movement ... 963 
** Summary ... 965 
** Bibliographical and Historical Notes ... 966 
** Exercises ... 969
* Robotics ... 971


** Introduction ... 971 
** Robot Hardware ... 973 
*** Sensors ... 973 
*** Effectors ... 975 
** Robotic Perception ... 978 
*** Localization and mapping ... 979 
*** Other types of perception ... 984 
*** Machine learning in robot perception ... 985 
** Planning to Move ... 986 
*** Configuration space ... 986 
*** Cell decomposition methods ... 989 
*** Modified cost functions ... 991 
*** Skeletonization methods ... 991 
** Planning Uncertain Movements ... 993 
*** Robust methods ... 994 
** Moving ... 997 
*** Dynamics and control ... 997 
*** Potential-field control ... 999 
*** Reactive control ... 1001 
*** Reinforcement learning control ... 1002 
** Robotic Software Architectures ... 1003 
*** Subsumption architecture ... 1003 
*** Three-layer architecture ... 1004 
*** Pipeline architecture ... 1005 
** Application Domains ... 1006 
** Summary ... 1010 
** Bibliographical and Historical Notes ... 1011 
** Exercises ... 1014

* Philosophical Foundations ... 1020


** Weak AI: Can Machines Act Intelligently? ... 1020 
*** The argument from disability ... 1021 
*** The mathematical objection ... 1022 
*** The argument from informality ... 1024 
** Strong AI: Can Machines Really Think? ... 1026 
*** Mental states and the brain in a vat ... 1028 
*** Functionalism and the brain replacement experiment ... 1029 
*** Biological naturalism and the Chinese Room ... 1031 
*** Consciousness, qualia, and the explanatory gap ... 1033 
** The Ethics and Risks of Developing Artificial Intelligence ... 1034 
** Summary ... 1040 
** Bibliographical and Historical Notes ... 1040 
** Exercises ... 1043
* AI: The Present and Future ... 1044


** Agent Components ... 1044 
** Agent Architectures ... 1047 
** Are We Going in the Right Direction? ... 1049 
