doc/artificial-intelligence-a-modern-approach.html
<div id="outline-container-sec-24-2-2" class="outline-4">
<h4 id="sec-24-2-2"><span class="section-number-4">24.2.2</span> Texture &#x2026; 939</h4>
</div>
<div id="outline-container-sec-24-2-3" class="outline-4">
<h4 id="sec-24-2-3"><span class="section-number-4">24.2.3</span> Optical flow &#x2026; 939</h4>
</div>
<div id="outline-container-sec-24-2-4" class="outline-4">
<h4 id="sec-24-2-4"><span class="section-number-4">24.2.4</span> Segmentation of images &#x2026; 941</h4>
</div>
</div>
<div id="outline-container-sec-24-3" class="outline-3">
<h3 id="sec-24-3"><span class="section-number-3">24.3</span> Object Recognition by Appearance &#x2026; 942</h3>
<div class="outline-text-3" id="text-24-3">
</div><div id="outline-container-sec-24-3-1" class="outline-4">
<h4 id="sec-24-3-1"><span class="section-number-4">24.3.1</span> Complex appearance and pattern elements &#x2026; 944</h4>
</div>
<div id="outline-container-sec-24-3-2" class="outline-4">
<h4 id="sec-24-3-2"><span class="section-number-4">24.3.2</span> Pedestrian detection with HOG features &#x2026; 945</h4>
</div>
</div>
<div id="outline-container-sec-24-4" class="outline-3">
<h3 id="sec-24-4"><span class="section-number-3">24.4</span> Reconstructing the 3D World &#x2026; 947</h3>
<div class="outline-text-3" id="text-24-4">
</div><div id="outline-container-sec-24-4-1" class="outline-4">
<h4 id="sec-24-4-1"><span class="section-number-4">24.4.1</span> Motion parallax &#x2026; 948</h4>
</div>
<div id="outline-container-sec-24-4-2" class="outline-4">
<h4 id="sec-24-4-2"><span class="section-number-4">24.4.2</span> Binocular stereopsis &#x2026; 949</h4>
</div>
<div id="outline-container-sec-24-4-3" class="outline-4">
<h4 id="sec-24-4-3"><span class="section-number-4">24.4.3</span> Multiple views &#x2026; 951</h4>
</div>
<div id="outline-container-sec-24-4-4" class="outline-4">
<h4 id="sec-24-4-4"><span class="section-number-4">24.4.4</span> Texture &#x2026; 951</h4>
</div>
<div id="outline-container-sec-24-4-5" class="outline-4">
<h4 id="sec-24-4-5"><span class="section-number-4">24.4.5</span> Shading &#x2026; 952</h4>
</div>
<div id="outline-container-sec-24-4-6" class="outline-4">
<h4 id="sec-24-4-6"><span class="section-number-4">24.4.6</span> Contour &#x2026; 953</h4>
</div>
<div id="outline-container-sec-24-4-7" class="outline-4">
<h4 id="sec-24-4-7"><span class="section-number-4">24.4.7</span> Objects and the geometric structure of scenes &#x2026; 954</h4>
</div>
</div>
<div id="outline-container-sec-24-5" class="outline-3">
<h3 id="sec-24-5"><span class="section-number-3">24.5</span> Object Recognition from Structural Information &#x2026; 957</h3>
<div class="outline-text-3" id="text-24-5">
</div><div id="outline-container-sec-24-5-1" class="outline-4">
<h4 id="sec-24-5-1"><span class="section-number-4">24.5.1</span> The geometry of bodies: Finding arms and legs &#x2026; 958</h4>
</div>
<div id="outline-container-sec-24-5-2" class="outline-4">
<h4 id="sec-24-5-2"><span class="section-number-4">24.5.2</span> Coherent appearance: Tracking people in video &#x2026; 959</h4>
</div>
</div>
<div id="outline-container-sec-24-6" class="outline-3">
<h3 id="sec-24-6"><span class="section-number-3">24.6</span> Using Vision &#x2026; 961</h3>
<div class="outline-text-3" id="text-24-6">
</div><div id="outline-container-sec-24-6-1" class="outline-4">
<h4 id="sec-24-6-1"><span class="section-number-4">24.6.1</span> Words and pictures &#x2026; 962</h4>
</div>
<div id="outline-container-sec-24-6-2" class="outline-4">
<h4 id="sec-24-6-2"><span class="section-number-4">24.6.2</span> Reconstruction from many views &#x2026; 962</h4>
</div>
<div id="outline-container-sec-24-6-3" class="outline-4">
<h4 id="sec-24-6-3"><span class="section-number-4">24.6.3</span> Using vision for controlling movement &#x2026; 963</h4>
</div>
</div>
<div id="outline-container-sec-24-7" class="outline-3">
<h3 id="sec-24-7"><span class="section-number-3">24.7</span> Summary &#x2026; 965</h3>
</div>
<div id="outline-container-sec-24-8" class="outline-3">
<h3 id="sec-24-8"><span class="section-number-3">24.8</span> Bibliographical and Historical Notes &#x2026; 966</h3>
</div>
<div id="outline-container-sec-24-9" class="outline-3">
<h3 id="sec-24-9"><span class="section-number-3">24.9</span> Exercises &#x2026; 969</h3>
</div>
</div>
<div id="outline-container-sec-25" class="outline-2">
<h2 id="sec-25"><span class="section-number-2">25</span> Robotics &#x2026; 971</h2>
<div class="outline-text-2" id="text-25">
</div><div id="outline-container-sec-25-1" class="outline-3">
<h3 id="sec-25-1"><span class="section-number-3">25.1</span> Introduction &#x2026; 971</h3>
</div>
<div id="outline-container-sec-25-2" class="outline-3">
<h3 id="sec-25-2"><span class="section-number-3">25.2</span> Robot Hardware &#x2026; 973</h3>
<div class="outline-text-3" id="text-25-2">
</div><div id="outline-container-sec-25-2-1" class="outline-4">
<h4 id="sec-25-2-1"><span class="section-number-4">25.2.1</span> Sensors &#x2026; 973</h4>
</div>
<div id="outline-container-sec-25-2-2" class="outline-4">
<h4 id="sec-25-2-2"><span class="section-number-4">25.2.2</span> Effectors &#x2026; 975</h4>
</div>
</div>
<div id="outline-container-sec-25-3" class="outline-3">
<h3 id="sec-25-3"><span class="section-number-3">25.3</span> Robotic Perception &#x2026; 978</h3>
<div class="outline-text-3" id="text-25-3">
</div><div id="outline-container-sec-25-3-1" class="outline-4">
<h4 id="sec-25-3-1"><span class="section-number-4">25.3.1</span> Localization and mapping &#x2026; 979</h4>
</div>
<div id="outline-container-sec-25-3-2" class="outline-4">
<h4 id="sec-25-3-2"><span class="section-number-4">25.3.2</span> Other types of perception &#x2026; 984</h4>
</div>
<div id="outline-container-sec-25-3-3" class="outline-4">
<h4 id="sec-25-3-3"><span class="section-number-4">25.3.3</span> Machine learning in robot perception &#x2026; 985</h4>
</div>
</div>
<div id="outline-container-sec-25-4" class="outline-3">
<h3 id="sec-25-4"><span class="section-number-3">25.4</span> Planning to Move &#x2026; 986</h3>
<div class="outline-text-3" id="text-25-4">
</div><div id="outline-container-sec-25-4-1" class="outline-4">
<h4 id="sec-25-4-1"><span class="section-number-4">25.4.1</span> Configuration space &#x2026; 986</h4>
</div>
<div id="outline-container-sec-25-4-2" class="outline-4">
<h4 id="sec-25-4-2"><span class="section-number-4">25.4.2</span> Cell decomposition methods &#x2026; 989</h4>
</div>
<div id="outline-container-sec-25-4-3" class="outline-4">
<h4 id="sec-25-4-3"><span class="section-number-4">25.4.3</span> Modified cost functions &#x2026; 991</h4>
</div>
<div id="outline-container-sec-25-4-4" class="outline-4">
<h4 id="sec-25-4-4"><span class="section-number-4">25.4.4</span> Skeletonization methods &#x2026; 991</h4>
</div>
</div>
<div id="outline-container-sec-25-5" class="outline-3">
<h3 id="sec-25-5"><span class="section-number-3">25.5</span> Planning Uncertain Movements &#x2026; 993</h3>
<div class="outline-text-3" id="text-25-5">
</div><div id="outline-container-sec-25-5-1" class="outline-4">
<h4 id="sec-25-5-1"><span class="section-number-4">25.5.1</span> Robust methods &#x2026; 994</h4>
</div>
</div>
<div id="outline-container-sec-25-6" class="outline-3">
<h3 id="sec-25-6"><span class="section-number-3">25.6</span> Moving &#x2026; 997</h3>
<div class="outline-text-3" id="text-25-6">
</div><div id="outline-container-sec-25-6-1" class="outline-4">
<h4 id="sec-25-6-1"><span class="section-number-4">25.6.1</span> Dynamics and control &#x2026; 997</h4>
</div>
<div id="outline-container-sec-25-6-2" class="outline-4">
<h4 id="sec-25-6-2"><span class="section-number-4">25.6.2</span> Potential-field control &#x2026; 999</h4>
</div>
<div id="outline-container-sec-25-6-3" class="outline-4">
<h4 id="sec-25-6-3"><span class="section-number-4">25.6.3</span> Reactive control &#x2026; 1001</h4>
</div>
<div id="outline-container-sec-25-6-4" class="outline-4">
<h4 id="sec-25-6-4"><span class="section-number-4">25.6.4</span> Reinforcement learning control &#x2026; 1002</h4>
</div>
</div>
<div id="outline-container-sec-25-7" class="outline-3">
<h3 id="sec-25-7"><span class="section-number-3">25.7</span> Robotic Software Architectures &#x2026; 1003</h3>
<div class="outline-text-3" id="text-25-7">
</div><div id="outline-container-sec-25-7-1" class="outline-4">
<h4 id="sec-25-7-1"><span class="section-number-4">25.7.1</span> Subsumption architecture &#x2026; 1003</h4>
</div>
<div id="outline-container-sec-25-7-2" class="outline-4">
<h4 id="sec-25-7-2"><span class="section-number-4">25.7.2</span> Three-layer architecture &#x2026; 1004</h4>
</div>
<div id="outline-container-sec-25-7-3" class="outline-4">
<h4 id="sec-25-7-3"><span class="section-number-4">25.7.3</span> Pipeline architecture &#x2026; 1005</h4>
</div>
</div>
<div id="outline-container-sec-25-8" class="outline-3">
<h3 id="sec-25-8"><span class="section-number-3">25.8</span> Application Domains &#x2026; 1006</h3>
</div>
<div id="outline-container-sec-25-9" class="outline-3">
<h3 id="sec-25-9"><span class="section-number-3">25.9</span> Summary &#x2026; 1010</h3>
</div>
<div id="outline-container-sec-25-10" class="outline-3">
<h3 id="sec-25-10"><span class="section-number-3">25.10</span> Bibliographical and Historical Notes &#x2026; 1011</h3>
</div>
<div id="outline-container-sec-25-11" class="outline-3">
<h3 id="sec-25-11"><span class="section-number-3">25.11</span> Exercises &#x2026; 1014</h3>
</div>
</div>

<div id="outline-container-sec-26" class="outline-2">
<h2 id="sec-26"><span class="section-number-2">26</span> Philosophical Foundations &#x2026; 1020</h2>
<div class="outline-text-2" id="text-26">
</div><div id="outline-container-sec-26-1" class="outline-3">
<h3 id="sec-26-1"><span class="section-number-3">26.1</span> Weak AI: Can Machines Act Intelligently? &#x2026; 1020</h3>
<div class="outline-text-3" id="text-26-1">
</div><div id="outline-container-sec-26-1-1" class="outline-4">
<h4 id="sec-26-1-1"><span class="section-number-4">26.1.1</span> The argument from disability &#x2026; 1021</h4>
</div>
<div id="outline-container-sec-26-1-2" class="outline-4">
<h4 id="sec-26-1-2"><span class="section-number-4">26.1.2</span> The mathematical objection &#x2026; 1022</h4>
</div>
<div id="outline-container-sec-26-1-3" class="outline-4">
<h4 id="sec-26-1-3"><span class="section-number-4">26.1.3</span> The argument from informality &#x2026; 1024</h4>
</div>
</div>
<div id="outline-container-sec-26-2" class="outline-3">
<h3 id="sec-26-2"><span class="section-number-3">26.2</span> Strong AI: Can Machines Really Think? &#x2026; 1026</h3>
<div class="outline-text-3" id="text-26-2">
</div><div id="outline-container-sec-26-2-1" class="outline-4">
<h4 id="sec-26-2-1"><span class="section-number-4">26.2.1</span> Mental states and the brain in a vat &#x2026; 1028</h4>
</div>
<div id="outline-container-sec-26-2-2" class="outline-4">
<h4 id="sec-26-2-2"><span class="section-number-4">26.2.2</span> Functionalism and the brain replacement experiment &#x2026; 1029</h4>
</div>
<div id="outline-container-sec-26-2-3" class="outline-4">
<h4 id="sec-26-2-3"><span class="section-number-4">26.2.3</span> Biological naturalism and the Chinese Room &#x2026; 1031</h4>
</div>
<div id="outline-container-sec-26-2-4" class="outline-4">
<h4 id="sec-26-2-4"><span class="section-number-4">26.2.4</span> Consciousness, qualia, and the explanatory gap &#x2026; 1033</h4>
</div>
</div>
<div id="outline-container-sec-26-3" class="outline-3">
<h3 id="sec-26-3"><span class="section-number-3">26.3</span> The Ethics and Risks of Developing Artificial Intelligence &#x2026; 1034</h3>
</div>
<div id="outline-container-sec-26-4" class="outline-3">
<h3 id="sec-26-4"><span class="section-number-3">26.4</span> Summary &#x2026; 1040</h3>
</div>
<div id="outline-container-sec-26-5" class="outline-3">
<h3 id="sec-26-5"><span class="section-number-3">26.5</span> Bibliographical and Historical Notes &#x2026; 1040</h3>
</div>
<div id="outline-container-sec-26-6" class="outline-3">
<h3 id="sec-26-6"><span class="section-number-3">26.6</span> Exercises &#x2026; 1043</h3>
</div>
</div>
<div id="outline-container-sec-27" class="outline-2">
<h2 id="sec-27"><span class="section-number-2">27</span> AI: The Present and Future &#x2026; 1044</h2>
<div class="outline-text-2" id="text-27">
</div><div id="outline-container-sec-27-1" class="outline-3">
<h3 id="sec-27-1"><span class="section-number-3">27.1</span> Agent Components &#x2026; 1044</h3>
</div>
<div id="outline-container-sec-27-2" class="outline-3">
<h3 id="sec-27-2"><span class="section-number-3">27.2</span> Agent Architectures &#x2026; 1047</h3>
</div>
<div id="outline-container-sec-27-3" class="outline-3">
<h3 id="sec-27-3"><span class="section-number-3">27.3</span> Are We Going in the Right Direction? &#x2026; 1049</h3>
</div>
